Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_apps/prime_service_dual_metering_demo/src/config/pic32cx_mtsh_db_pl460_rf215/driver/metrology/drv_metrology_regs.h
/*
Copyright (C) 2023, Microchip Technology Inc., and its subsidiaries. All rights reserved.

The software and documentation is provided by microchip and its contributors
"as is" and any express, implied or statutory warranties, including, but not
limited to, the implied warranties of merchantability, fitness for a particular
purpose and non-infringement of third party intellectual property rights are
disclaimed to the fullest extent permitted by law. In no event shall microchip
or its contributors be liable for any direct, indirect, incidental, special,
exemplary, or consequential damages (including, but not limited to, procurement
of substitute goods or services; loss of use, data, or profits; or business
interruption) however caused and on any theory of liability, whether in contract,
strict liability, or tort (including negligence or otherwise) arising in any way
out of the use of the software and documentation, even if advised of the
possibility of such damage.

Except as expressly permitted hereunder and subject to the applicable license terms
for any third-party software incorporated in the software and any applicable open
source software license terms, no license or other rights, whether express or
implied, are granted under any patent or other intellectual property rights of
Microchip or any third party.
*/

#ifndef METROLOGY_REGS_H
#define METROLOGY_REGS_H

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR METROLOGY REGISTERS                          */
/* ************************************************************************** */
/* MISRA C-2023 deviation block start */
/* MISRA C-2023 Rule 5.4 deviated 64 times.  Deviation record ID - H3_MISRAC_2023_R_5_4_DR_1 */

/* -------- STATE_CTRL : (R/W 32) Metrology state control register -------- */
#define STATE_CTRL_STATE_CTRL_Pos                     _UINT32_(0)                               /* (STATE_CTRL) State Control Position */
#define STATE_CTRL_STATE_CTRL_Msk                     (_UINT32_(0xF) << STATE_CTRL_STATE_CTRL_Pos)         /* (STATE_CTRL) State Control Mask */
#define STATE_CTRL_STATE_CTRL(value)                  (STATE_CTRL_STATE_CTRL_Msk & (_UINT32_(value) << STATE_CTRL_STATE_CTRL_Pos))
#define   STATE_CTRL_STATE_CTRL_RESET_Val               _UINT32_(0x0)                           /* (STATE_CTRL) Reset metrology module, reset ATSENSE and halt metrology filters.  */
#define   STATE_CTRL_STATE_CTRL_INIT_Val                _UINT32_(0x1)                           /* (STATE_CTRL) Input control registers are initialized and metrology can initialize itself.  */
#define   STATE_CTRL_STATE_CTRL_RUN_Val                 _UINT32_(0x2)                           /* (STATE_CTRL) Metrology filters are free to run, and outputs are updated at commanded rate.  */

/* -------- FEATURE_CTRL : (R/W 32) Metrology feature setting register 0 -------- */
#define FEATURE_CTRL_RZC_CHAN_SELECT_Pos             _UINT32_(0)                               /* (FEATURE_CTRL) Raw Zero-Crossing Channel Select Position */
#define FEATURE_CTRL_RZC_CHAN_SELECT_Msk             (_UINT32_(0x7) << FEATURE_CTRL_RZC_CHAN_SELECT_Pos)    /* (FEATURE_CTRL) Raw Zero-Crossing Channel Select Mask */
#define FEATURE_CTRL_RZC_CHAN_SELECT(value)          (FEATURE_CTRL_RZC_CHAN_SELECT_Msk & (_UINT32_(value) << FEATURE_CTRL_RZC_CHAN_SELECT_Pos))
#define   FEATURE_CTRL_RZC_CHAN_SELECT_DISABLED_Val    _UINT32_(0x0)                           /* (FEATURE_CTRL) Raw Zero-Crossing detection is disabled */
#define   FEATURE_CTRL_RZC_CHAN_SELECT_V1_Val          _UINT32_(0x1)                           /* (FEATURE_CTRL) Raw Zero-Crossing detection based on input voltage channel V1 */
#define   FEATURE_CTRL_RZC_CHAN_SELECT_V2_Val          _UINT32_(0x3)                           /* (FEATURE_CTRL) Raw Zero-Crossing detection based on input voltage channel V2 */
#define   FEATURE_CTRL_RZC_CHAN_SELECT_V3_Val          _UINT32_(0x5)                           /* (FEATURE_CTRL) Raw Zero-Crossing detection based on input voltage channel V3 */
#define FEATURE_CTRL_RZC_DIR_Pos                     _UINT32_(3)                               /* (FEATURE_CTRL) Raw Zero-Crossing Direction Selection Position */
#define FEATURE_CTRL_RZC_DIR_Msk                     (_UINT32_(0x1) << FEATURE_CTRL_RZC_DIR_Pos)            /* (FEATURE_CTRL) Raw Zero-Crossing Direction Selection Mask */
#define FEATURE_CTRL_RZC_DIR(value)                  (FEATURE_CTRL_RZC_DIR_Msk & (_UINT32_(value) << FEATURE_CTRL_RZC_DIR_Pos))
#define   FEATURE_CTRL_RZC_DIR_POSITIVE_Val            _UINT32_(0x0)                           /* (FEATURE_CTRL) Positive-going raw zero-crossings selected */
#define   FEATURE_CTRL_RZC_DIR_NEGATIVE_Val            _UINT32_(0x1)                           /* (FEATURE_CTRL) Negative-going raw zero-crossings selected */
#define FEATURE_CTRL_SYNCH_Pos                       _UINT32_(4)                               /* (FEATURE_CTRL) Active Voltage Channel Selection Position */
#define FEATURE_CTRL_SYNCH_Msk                       (_UINT32_(0x3) << FEATURE_CTRL_SYNCH_Pos)    /* (FEATURE_CTRL) Active Voltage Channel Selection Mask */
#define FEATURE_CTRL_SYNCH(value)                    (FEATURE_CTRL_SYNCH_Msk & (_UINT32_(value) << FEATURE_CTRL_SYNCH_Pos))
#define   FEATURE_CTRL_SYNCH_ACTIVE_PHASE_Val          _UINT32_(0x0)                           /* (FEATURE_CTRL) Measurement interval based on active phase, determined dynamically */
#define   FEATURE_CTRL_SYNCH_A_Val                     _UINT32_(0x1)                           /* (FEATURE_CTRL) Measurement interval based on phase-A */
#define   FEATURE_CTRL_SYNCH_B_Val                     _UINT32_(0x2)                           /* (FEATURE_CTRL) Measurement interval based on phase-B */
#define   FEATURE_CTRL_SYNCH_C_Val                     _UINT32_(0x3)                           /* (FEATURE_CTRL) Measurement interval based on phase-C */
#define FEATURE_CTRL_RZC_THRESHOLD_DIS_Pos           _UINT32_(7)                               /* (FEATURE_CTRL) Raw Zero-Crossing Threshold Disable Position */
#define FEATURE_CTRL_RZC_THRESHOLD_DIS_Msk           (_UINT32_(0x1) << FEATURE_CTRL_RZC_THRESHOLD_DIS_Pos)  /* (FEATURE_CTRL) Raw Zero-Crossing Threshold Disable Mask */
#define FEATURE_CTRL_RZC_THRESHOLD_DIS(value)        (FEATURE_CTRL_RZC_THRESHOLD_DIS_Msk & (_UINT32_(value) << FEATURE_CTRL_RZC_THRESHOLD_DIS_Pos))
#define   FEATURE_CTRL_RZC_THRESHOLD_DIS_AVG_Val       _UINT32_(0x0)                           /* (FEATURE_CTRL) Threshold set to the average value computed in the last integration period */
#define   FEATURE_CTRL_RZC_THRESHOLD_DIS_0_Val         _UINT32_(0x1)                           /* (FEATURE_CTRL) Threshold set to 0 */
#define FEATURE_CTRL_PHASE_A_EN_Pos                  _UINT32_(8)                               /* (FEATURE_CTRL) Enable Phase A Position */
#define FEATURE_CTRL_PHASE_A_EN_Msk                  (_UINT32_(0x1) << FEATURE_CTRL_PHASE_A_EN_Pos)    /* (FEATURE_CTRL) Enable Phase A Mask */
#define FEATURE_CTRL_PHASE_A_EN(value)               (FEATURE_CTRL_PHASE_A_EN_Msk & (_UINT32_(value) << FEATURE_CTRL_PHASE_A_EN_Pos))
#define   FEATURE_CTRL_PHASE_A_EN_DISABLED_Val         _UINT32_(0x0)                           /* (FEATURE_CTRL) Disable phase */
#define   FEATURE_CTRL_PHASE_A_EN_ENABLED_Val          _UINT32_(0x1)                           /* (FEATURE_CTRL) Enable phase */
#define FEATURE_CTRL_PHASE_B_EN_Pos                  _UINT32_(9)                               /* (FEATURE_CTRL) Enable Phase B Position */
#define FEATURE_CTRL_PHASE_B_EN_Msk                  (_UINT32_(0x1) << FEATURE_CTRL_PHASE_B_EN_Pos)    /* (FEATURE_CTRL) Enable Phase B Mask */
#define FEATURE_CTRL_PHASE_B_EN(value)               (FEATURE_CTRL_PHASE_B_EN_Msk & (_UINT32_(value) << FEATURE_CTRL_PHASE_B_EN_Pos))
#define   FEATURE_CTRL_PHASE_B_EN_DISABLED_Val         _UINT32_(0x0)                           /* (FEATURE_CTRL) Disable phase */
#define   FEATURE_CTRL_PHASE_B_EN_ENABLED_Val          _UINT32_(0x1)                           /* (FEATURE_CTRL) Enable phase */
#define FEATURE_CTRL_PHASE_C_EN_Pos                  _UINT32_(10)                               /* (FEATURE_CTRL) Enable Phase C Position */
#define FEATURE_CTRL_PHASE_C_EN_Msk                  (_UINT32_(0x1) << FEATURE_CTRL_PHASE_C_EN_Pos)    /* (FEATURE_CTRL) Enable Phase C Mask */
#define FEATURE_CTRL_PHASE_C_EN(value)               (FEATURE_CTRL_PHASE_C_EN_Msk & (_UINT32_(value) << FEATURE_CTRL_PHASE_C_EN_Pos))
#define   FEATURE_CTRL_PHASE_C_EN_DISABLED_Val         _UINT32_(0x0)                           /* (FEATURE_CTRL) Disable phase */
#define   FEATURE_CTRL_PHASE_C_EN_ENABLED_Val          _UINT32_(0x1)                           /* (FEATURE_CTRL) Enable phase */
#define FEATURE_CTRL_NEUTRAL_DIS_Pos                 _UINT32_(11)                               /* (FEATURE_CTRL) Disable neutral measurement Position */
#define FEATURE_CTRL_NEUTRAL_DIS_Msk                 (_UINT32_(0x1) << FEATURE_CTRL_NEUTRAL_DIS_Pos)  /* (FEATURE_CTRL) Disable neutral measurement Mask */
#define FEATURE_CTRL_NEUTRAL_DIS(value)              (FEATURE_CTRL_NEUTRAL_DIS_Msk & (_UINT32_(value) << FEATURE_CTRL_NEUTRAL_DIS_Pos))
#define   FEATURE_CTRL_NEUTRAL_DIS_DISABLE_Val         _UINT32_(0x0)                           /* (FEATURE_CTRL) Neutral measurement is disabled, and the shared channel is continuously acquiring temperature readings */
#define   FEATURE_CTRL_NEUTRAL_DIS_ENABLE_Val          _UINT32_(0x1)                           /* (FEATURE_CTRL) Neutral and temperature measurements are acquired using the shared channel */
#define FEATURE_CTRL_MAX_INT_SELECT_Pos              _UINT32_(12)                               /* (FEATURE_CTRL) Max Integration Period Select Position */
#define FEATURE_CTRL_MAX_INT_SELECT_Msk              (_UINT32_(0x1) << FEATURE_CTRL_MAX_INT_SELECT_Pos)    /* (FEATURE_CTRL) Max Integration Period Select Mask */
#define FEATURE_CTRL_MAX_INT_SELECT(value)           (FEATURE_CTRL_MAX_INT_SELECT_Msk & (_UINT32_(value) << FEATURE_CTRL_MAX_INT_SELECT_Pos))
#define   FEATURE_CTRL_MAX_INT_SELECT_CL1_Val           _UINT32_(0x0)                           /* (FEATURE_CTRL) Metrology DSP will integrate for an integral number of cycles closest to 1 second */
#define   FEATURE_CTRL_MAX_INT_SELECT_NGT1_Val          _UINT32_(0x1)                           /* (FEATURE_CTRL) Metrology DSP will integrate for an integral number of cycles no greater than 1 second */
#define FEATURE_CTRL_SYNTH_EN_Pos                    _UINT32_(13)                               /* (FEATURE_CTRL) Synthesizer Enable Position */
#define FEATURE_CTRL_SYNTH_EN_Msk                    (_UINT32_(0x1) << FEATURE_CTRL_SYNTH_EN_Pos)    /* (FEATURE_CTRL) Synthesizer Enable Mask */
#define FEATURE_CTRL_SYNTH_EN(value)                 (FEATURE_CTRL_SYNTH_EN_Msk & (_UINT32_(value) << FEATURE_CTRL_SYNTH_EN_Pos))
#define   FEATURE_CTRL_SYNTH_EN_ENABLED_Val             _UINT32_(0x0)                           /* (FEATURE_CTRL) Synthesizer Enabled */
#define   FEATURE_CTRL_SYNTH_EN_DISABLED_Val            _UINT32_(0x1)                           /* (FEATURE_CTRL) Synthesizer Disabled */
#define FEATURE_CTRL_VD_DC_EN_Pos                    _UINT32_(15)                               /* (FEATURE_CTRL) Enable DC for VD channel Position */
#define FEATURE_CTRL_VD_DC_EN_Msk                    (_UINT32_(0x1) << FEATURE_CTRL_VD_DC_EN_Pos)    /* (FEATURE_CTRL) Enable DC for VD channel Mask */
#define FEATURE_CTRL_VD_DC_EN(value)                 (FEATURE_CTRL_VD_DC_EN_Msk & (_UINT32_(value) << FEATURE_CTRL_VD_DC_EN_Pos))
#define   FEATURE_CTRL_VD_DC_EN_ENABLED_Val             _UINT32_(0x0)                           /* (FEATURE_CTRL) DC is included in VD channel */
#define   FEATURE_CTRL_VD_DC_EN_DISABLED_Val            _UINT32_(0x1)                           /* (FEATURE_CTRL) DC is removed from VD channel */
#define FEATURE_CTRL_SWAP_B_and_C_Pos                _UINT32_(16)                              /* (FEATURE_CTRL) Swap processing channels Position */
#define FEATURE_CTRL_SWAP_B_and_C_Msk                (_UINT32_(0x1) << FEATURE_CTRL_SWAP_B_and_C_Pos)    /* (FEATURE_CTRL) Swap processing channels Mask */
#define FEATURE_CTRL_SWAP_B_and_C(value)             (FEATURE_CTRL_SWAP_B_and_C_Msk & (_UINT32_(value) << FEATURE_CTRL_SWAP_B_and_C_Pos))
#define   FEATURE_CTRL_SWAP_B_and_C_I2IB_Val           _UINT32_(0x0)                           /* (FEATURE_CTRL) DSP input mapping: I2/V2 mapped I_B/V_B; I3/V3 mapped I_C/V_C (default) */
#define   FEATURE_CTRL_SWAP_B_and_C_I2IC_Val           _UINT32_(0x1)                           /* (FEATURE_CTRL) DSP input mapping: I2/V2 mapped I_C/V_C; I3/V3 mapped I_B/V_B */
#define FEATURE_CTRL_I_MAX_RESET_Pos                 _UINT32_(17)                                /* (FEATURE_CTRL) Reset All I_x_MAX values Position */
#define FEATURE_CTRL_I_MAX_RESET_Msk                 (_UINT32_(0x1) << FEATURE_CTRL_I_MAX_RESET_Pos)    /* (FEATURE_CTRL) Reset All I_x_MAX values Mask */
#define FEATURE_CTRL_I_MAX_RESET(value)              (FEATURE_CTRL_I_MAX_RESET_Msk & (_UINT32_(value) << FEATURE_CTRL_I_MAX_RESET_Pos))
#define FEATURE_CTRL_V_MAX_RESET_Pos                 _UINT32_(18)                                /* (FEATURE_CTRL) Reset All V_x_MAX values Position */
#define FEATURE_CTRL_V_MAX_RESET_Msk                 (_UINT32_(0x1) << FEATURE_CTRL_V_MAX_RESET_Pos)    /* (FEATURE_CTRL) Reset All V_x_MAX values Mask */
#define FEATURE_CTRL_V_MAX_RESET(value)              (FEATURE_CTRL_V_MAX_RESET_Msk & (_UINT32_(value) << FEATURE_CTRL_V_MAX_RESET_Pos))
#define FEATURE_CTRL_CREEP_I_EN_Pos                  _UINT32_(20)                                /* (FEATURE_CTRL) Current Creep Threshold Function Enable Position */
#define FEATURE_CTRL_CREEP_I_EN_Msk                  (_UINT32_(0x1) << FEATURE_CTRL_CREEP_I_EN_Pos)    /* (FEATURE_CTRL) Current Creep Threshold Function Enable Mask */
#define FEATURE_CTRL_CREEP_I_EN(value)               (FEATURE_CTRL_CREEP_I_EN_Msk & (_UINT32_(value) << FEATURE_CTRL_CREEP_I_EN_Pos))
#define   FEATURE_CTRL_CREEP_I_EN_DISABLED_Val         _UINT32_(0x0)                             /* (FEATURE_CTRL) Disable current creep threshold feature */
#define   FEATURE_CTRL_CREEP_I_EN_ENABLED_Val          _UINT32_(0x1)                             /* (FEATURE_CTRL) Enable current creep threshold feature */
#define FEATURE_CTRL_CREEP_Q_EN_Pos                  _UINT32_(21)                                /* (FEATURE_CTRL) Reactive Power Creep Threshold Function Enable Position */
#define FEATURE_CTRL_CREEP_Q_EN_Msk                  (_UINT32_(0x1) << FEATURE_CTRL_CREEP_Q_EN_Pos)    /* (FEATURE_CTRL) Reactive Power Creep Threshold Function Enable Mask */
#define FEATURE_CTRL_CREEP_Q_EN(value)               (FEATURE_CTRL_CREEP_Q_EN_Msk & (_UINT32_(value) << FEATURE_CTRL_CREEP_Q_EN_Pos))
#define   FEATURE_CTRL_CREEP_Q_EN_DISABLED_Val         _UINT32_(0x0)                             /* (FEATURE_CTRL) Disable Reactive Power creep threshold feature */
#define   FEATURE_CTRL_CREEP_Q_EN_ENABLED_Val          _UINT32_(0x1)                             /* (FEATURE_CTRL) Enable Reactive Power creep threshold feature */
#define FEATURE_CTRL_CREEP_P_EN_Pos                  _UINT32_(22)                                /* (FEATURE_CTRL) Active Power Creep Threshold Function Enable Position */
#define FEATURE_CTRL_CREEP_P_EN_Msk                  (_UINT32_(0x1) << FEATURE_CTRL_CREEP_P_EN_Pos)    /* (FEATURE_CTRL) Active Power Creep Threshold Function Enable Mask */
#define FEATURE_CTRL_CREEP_P_EN(value)               (FEATURE_CTRL_CREEP_P_EN_Msk & (_UINT32_(value) << FEATURE_CTRL_CREEP_P_EN_Pos))
#define   FEATURE_CTRL_CREEP_P_EN_DISABLED_Val         _UINT32_(0x0)                             /* (FEATURE_CTRL) Disable Active Power creep threshold feature */
#define   FEATURE_CTRL_CREEP_P_EN_ENABLED_Val          _UINT32_(0x1)                             /* (FEATURE_CTRL) Enable Active Power creep threshold feature */
#define FEATURE_CTRL_CREEP_S_EN_Pos                  _UINT32_(23)                                /* (FEATURE_CTRL) Aparent Power Creep Threshold Function Enable Position */
#define FEATURE_CTRL_CREEP_S_EN_Msk                  (_UINT32_(0x1) << FEATURE_CTRL_CREEP_S_EN_Pos)    /* (FEATURE_CTRL) Aparent Power Creep Threshold Function Enable Mask */
#define FEATURE_CTRL_CREEP_S_EN(value)               (FEATURE_CTRL_CREEP_S_EN_Msk & (_UINT32_(value) << FEATURE_CTRL_CREEP_S_EN_Pos))
#define   FEATURE_CTRL_CREEP_S_EN_DISABLED_Val         _UINT32_(0x0)                             /* (FEATURE_CTRL) Disable Aparent Power creep threshold feature */
#define   FEATURE_CTRL_CREEP_S_EN_ENABLED_Val          _UINT32_(0x1)                             /* (FEATURE_CTRL) Enable Aparent Power creep threshold feature */
#define FEATURE_CTRL_IA_HARM_DIS_Pos                 _UINT32_(24)                                /* (FEATURE_CTRL) Disable Harmonic IA Analysis */
#define FEATURE_CTRL_IA_HARM_DIS_Msk                 (_UINT32_(0x1) << FEATURE_CTRL_IA_HARM_DIS_Pos)    /* (FEATURE_CTRL) Enable Harmonic IA Analysis Mask */
#define FEATURE_CTRL_IA_HARM_DIS(value)              (FEATURE_CTRL_IA_HARM_DIS_Msk & (_UINT32_(value) << FEATURE_CTRL_IA_HARM_DIS_Pos))
#define   FEATURE_CTRL_IA_HARM_ENABLED_Val             _UINT32_(0x0)                             /* (FEATURE_CTRL) Enable harmonic IA Analysis  */
#define   FEATURE_CTRL_IA_HARM_DISABLED_Val            _UINT32_(0x1)                             /* (FEATURE_CTRL) Disable harmonic IA Analysis  */
#define FEATURE_CTRL_VA_HARM_DIS_Pos                 _UINT32_(25)                                /* (FEATURE_CTRL) Disable Harmonic VA Analysis */
#define FEATURE_CTRL_VA_HARM_DIS_Msk                 (_UINT32_(0x1) << FEATURE_CTRL_VA_HARM_DIS_Pos)    /* (FEATURE_CTRL) Enable Harmonic VA Analysis Mask */
#define FEATURE_CTRL_VA_HARM_DIS(value)              (FEATURE_CTRL_VA_HARM_DIS_Msk & (_UINT32_(value) << FEATURE_CTRL_VA_HARM_DIS_Pos))
#define   FEATURE_CTRL_VA_HARM_ENABLED_Val             _UINT32_(0x0)                             /* (FEATURE_CTRL) Enable harmonic VA Analysis  */
#define   FEATURE_CTRL_VA_HARM_DISABLED_Val            _UINT32_(0x1)                             /* (FEATURE_CTRL) Disable harmonic VA Analysis  */
#define FEATURE_CTRL_IB_HARM_DIS_Pos                 _UINT32_(26)                                /* (FEATURE_CTRL) Disable Harmonic IB Analysis */
#define FEATURE_CTRL_IB_HARM_DIS_Msk                 (_UINT32_(0x1) << FEATURE_CTRL_IB_HARM_DIS_Pos)    /* (FEATURE_CTRL) Enable Harmonic IB Analysis Mask */
#define FEATURE_CTRL_IB_HARM_DIS(value)              (FEATURE_CTRL_IB_HARM_DIS_Msk & (_UINT32_(value) << FEATURE_CTRL_IB_HARM_DIS_Pos))
#define   FEATURE_CTRL_IB_HARM_ENABLED_Val             _UINT32_(0x0)                             /* (FEATURE_CTRL) Enable harmonic IB Analysis  */
#define   FEATURE_CTRL_IB_HARM_DISABLED_Val            _UINT32_(0x1)                             /* (FEATURE_CTRL) Disable harmonic IB Analysis  */
#define FEATURE_CTRL_VB_HARM_DIS_Pos                 _UINT32_(27)                                /* (FEATURE_CTRL) Disable Harmonic VB Analysis */
#define FEATURE_CTRL_VB_HARM_DIS_Msk                 (_UINT32_(0x1) << FEATURE_CTRL_VB_HARM_DIS_Pos)    /* (FEATURE_CTRL) Enable Harmonic VB Analysis Mask */
#define FEATURE_CTRL_VB_HARM_DIS(VBlue)              (FEATURE_CTRL_VB_HARM_DIS_Msk & (_UINT32_(Value) << FEATURE_CTRL_VB_HARM_DIS_Pos))
#define   FEATURE_CTRL_VB_HARM_ENABLED_Val             _UINT32_(0x0)                             /* (FEATURE_CTRL) Enable harmonic VB Analysis  */
#define   FEATURE_CTRL_VB_HARM_DISABLED_Val            _UINT32_(0x1)                             /* (FEATURE_CTRL) Disable harmonic VB Analysis  */
#define FEATURE_CTRL_IC_HARM_DIS_Pos                 _UINT32_(28)                                /* (FEATURE_CTRL) Disable Harmonic IC Analysis */
#define FEATURE_CTRL_IC_HARM_DIS_Msk                 (_UINT32_(0x1) << FEATURE_CTRL_IC_HARM_DIS_Pos)    /* (FEATURE_CTRL) Enable Harmonic IC Analysis Mask */
#define FEATURE_CTRL_IC_HARM_DIS(value)              (FEATURE_CTRL_IC_HARM_DIS_Msk & (_UINT32_(value) << FEATURE_CTRL_IC_HARM_DIS_Pos))
#define   FEATURE_CTRL_IC_HARM_ENABLED_Val             _UINT32_(0x0)                             /* (FEATURE_CTRL) Enable harmonic IC Analysis  */
#define   FEATURE_CTRL_IC_HARM_DISABLED_Val            _UINT32_(0x1)                             /* (FEATURE_CTRL) Disable harmonic IC Analysis  */
#define FEATURE_CTRL_VC_HARM_DIS_Pos                 _UINT32_(29)                                /* (FEATURE_CTRL) Disable Harmonic VC Analysis */
#define FEATURE_CTRL_VC_HARM_DIS_Msk                 (_UINT32_(0x1) << FEATURE_CTRL_VC_HARM_DIS_Pos)    /* (FEATURE_CTRL) Enable Harmonic VC Analysis Mask */
#define FEATURE_CTRL_VC_HARM_DIS(value)              (FEATURE_CTRL_VC_HARM_DIS_Msk & (_UINT32_(value) << FEATURE_CTRL_VC_HARM_DIS_Pos))
#define   FEATURE_CTRL_VC_HARM_ENABLED_Val             _UINT32_(0x0)                             /* (FEATURE_CTRL) Enable harmonic VC Analysis  */
#define   FEATURE_CTRL_VC_HARM_DISABLED_Val            _UINT32_(0x1)                             /* (FEATURE_CTRL) Disable harmonic VC Analysis  */
#define FEATURE_CTRL_IN_HARM_DIS_Pos                 _UINT32_(30)                                /* (FEATURE_CTRL) Disable Harmonic IN Analysis */
#define FEATURE_CTRL_IN_HARM_DIS_Msk                 (_UINT32_(0x1) << FEATURE_CTRL_IN_HARM_DIS_Pos)    /* (FEATURE_CTRL) Enable Harmonic IN Analysis Mask */
#define FEATURE_CTRL_IN_HARM_DIS(value)              (FEATURE_CTRL_IN_HARM_DIS_Msk & (_UINT32_(value) << FEATURE_CTRL_IN_HARM_DIS_Pos))
#define   FEATURE_CTRL_IN_HARM_ENABLED_Val             _UINT32_(0x0)                             /* (FEATURE_CTRL) Enable harmonic IN Analysis  */
#define   FEATURE_CTRL_IN_HARM_DISABLED_Val            _UINT32_(0x1)                             /* (FEATURE_CTRL) Disable harmonic IN Analysis  */

/* -------- AFE_SELECTION : (R/W 32) AFE selection register -------- */
#define AFE_SELECTION_DEV_Pos                 _UINT32_(28)                                /* (AFE_SELECTION) Configure the Analog Front End (AFE) */
#define AFE_SELECTION_DEV_Msk                 (_UINT32_(0xF) << AFE_SELECTION_DEV_Pos)    /* (AFE_SELECTION) Configure the Analog Front End (AFE) Mask */
#define AFE_SELECTION_DEV(value)              (AFE_SELECTION_DEV_Msk & (_UINT32_(value) << AFE_SELECTION_DEV_Pos))
#define   AFE_SELECTION_DEV_1xATSENSE301        _UINT32_(0x0)                             /* (AFE_SELECTION) 1xATSENSE301: 7 channels (3 voltages and 4 currents)  */
#define   AFE_SELECTION_DEV_3xMCP1910           _UINT32_(0x1)                             /* (AFE_SELECTION) 3xMCP1910: Typically used for 3 phase shunt meters   */
#define   AFE_SELECTION_DEV_4xMCP1910           _UINT32_(0x2)                             /* (AFE_SELECTION) 4xMCP1910: Typically used for 3 phase shunt meters with neutral current measurement  */
#define   AFE_SELECTION_DEV_1xMCP3912           _UINT32_(0x3)                             /* (AFE_SELECTION) 1xMCP3912: 4 channels (2 voltages and 2 currents) */
#define   AFE_SELECTION_DEV_1xMCP3913           _UINT32_(0x4)                             /* (AFE_SELECTION) 1xMCP3913: 6 channels (3 voltages and 3 currents) */
#define   AFE_SELECTION_DEV_1xMCP3914           _UINT32_(0x5)                             /* (AFE_SELECTION) 1xMCP3914: 8 channels (4 voltages and 4 currents) */

