Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_apps/prime_service_dual_metering_demo/src/config/pic32cx_mtsh_db_pl460_rf215/driver/metrology/drv_metrology_regs.h
/* -------- PULSE1_CTRL : (R/W  32) Pulse 1 control: enable/disable, polarity, quantity type selection -------- */
#define PULSE1_CTRL_PC1_WIDTH_Pos                  _UINT32_(0)                                 /* (PULSE1_CTRL) Pulse Width  */
#define PULSE1_CTRL_PC1_WIDTH_Msk                  (_UINT32_(0xFFFF) << PULSE1_CTRL_PC1_WIDTH_Pos)      /* (PULSE1_CTRL) Pulse Width  */
#define PULSE1_CTRL_PC1_WIDTH(value)               (PULSE1_CTRL_PC1_WIDTH_Msk & (_UINT32_(value) << PULSE1_CTRL_PC1_WIDTH_Pos))
#define PULSE1_CTRL_PC1_TYPE_Pos                  _UINT32_(16)                                 /* (PULSE1_CTRL) Pulse Type Selection Position */
#define PULSE1_CTRL_PC1_TYPE_Msk                  (_UINT32_(0xF) << PULSE1_CTRL_PC1_TYPE_Pos)      /* (PULSE1_CTRL) Pulse Type Selection Mask */
#define PULSE1_CTRL_PC1_TYPE(value)               (PULSE1_CTRL_PC1_TYPE_Msk & (_UINT32_(value) << PULSE1_CTRL_PC1_TYPE_Pos))
#define   PULSE1_CTRL_PC1_TYPE_P_T_Val              _UINT32_(0x0)                             /* (PULSE1_CTRL) Watt-hours, total all phases, fundamental + harmonics */
#define   PULSE1_CTRL_PC1_TYPE_P_T_F_Val            _UINT32_(0x1)                             /* (PULSE1_CTRL) Watt-hours, total all phases, fundamental only */
#define   PULSE1_CTRL_PC1_TYPE_Q_T_Val              _UINT32_(0x2)                             /* (PULSE1_CTRL) Var-hours, total all phases, fundamental + harmonics */
#define   PULSE1_CTRL_PC1_TYPE_Q_T_F_Val            _UINT32_(0x3)                             /* (PULSE1_CTRL) Var-hours, total all phases, fundamental only */
#define   PULSE1_CTRL_PC1_TYPE_I_T_Val              _UINT32_(0x4)                             /* (PULSE1_CTRL) Amp-squared-hours, total all phases, fundamental + harmonics */
#define   PULSE1_CTRL_PC1_TYPE_I_T_F_Val            _UINT32_(0x5)                             /* (PULSE1_CTRL) Amp-squared-hours, total all phases, fundamental only */
#define   PULSE1_CTRL_PC1_TYPE_S_T_Val              _UINT32_(0x6)                             /* (PULSE1_CTRL) VA-hours, total all phases, fundamental + harmonics. It is computed by multiplying Irms by Vrms */
#define   PULSE1_CTRL_PC1_TYPE_S_T_F_Val            _UINT32_(0x7)                             /* (PULSE1_CTRL) VA-hours, total all phases, fundamental only. It is computed by multiplying Irms (fundamental) by Vrms (fundamental) */
#define   PULSE1_CTRL_PC1_TYPE_S2_T_Val             _UINT32_(0x8)                             /* (PULSE1_CTRL) VA-hours, total all phases. It is computed as the square root of (P2+Q2) */
#define PULSE1_CTRL_PC1_POLARITY_Pos               _UINT32_(24)                                 /* (PULSE1_CTRL) Pulse Polarity Position  */
#define PULSE1_CTRL_PC1_POLARITY_Msk               (_UINT32_(0x1) << PULSE1_CTRL_PC1_POLARITY_Pos)      /* (PULSE1_CTRL) Pulse Polarity Mask  */
#define PULSE1_CTRL_PC1_POLARITY(value)            (PULSE1_CTRL_PC1_POLARITY_Msk & (_UINT32_(value) << PULSE1_CTRL_PC1_POLARITY_Pos))
#define   PULSE1_CTRL_PC1_POLARITY_LOW_Val           _UINT32_(0x0)                             /* (PULSE1_CTRL) Output pulse is low with width set by K_WIDTH, followed by an inactive level of high */
#define   PULSE1_CTRL_PC1_POLARITY_HIGH_Val          _UINT32_(0x1)                             /* (PULSE1_CTRL) Output pulse is high with width set by K_WIDTH, followed by an inactive level of low */
#define PULSE1_CTRL_PC1_OVERRIDE_Pos               _UINT32_(25)                                 /* (PULSE1_CTRL) Pulse Override Control Position  */
#define PULSE1_CTRL_PC1_OVERRIDE_Msk               (_UINT32_(0x1) << PULSE1_CTRL_PC1_OVERRIDE_Pos)      /* (PULSE1_CTRL) Pulse Override Control Mask  */
#define PULSE1_CTRL_PC1_OVERRIDE(value)            (PULSE1_CTRL_PC1_OVERRIDE_Msk & (_UINT32_(value) << PULSE1_CTRL_PC1_OVERRIDE_Pos))
#define   PULSE1_CTRL_PC1_OVERRIDE_ENABLED_Val       _UINT32_(0x0)                             /* (PULSE1_CTRL) Pulse generation functions as normal */
#define   PULSE1_CTRL_PC1_OVERRIDE_DISABLED_Val      _UINT32_(0x1)                             /* (PULSE1_CTRL) Pulse generation is temporarily disabled */
#define PULSE1_CTRL_PC1_ACC_HOLD_Pos               _UINT32_(26)                                 /* (PULSE1_CTRL) Pulse Accumulation Hold Control Position  */
#define PULSE1_CTRL_PC1_ACC_HOLD_Msk               (_UINT32_(0x1) << PULSE1_CTRL_PC1_ACC_HOLD_Pos)      /* (PULSE1_CTRL) Pulse Accumulation Hold Control Mask  */
#define PULSE1_CTRL_PC1_ACC_HOLD(value)            (PULSE1_CTRL_PC1_ACC_HOLD_Msk & (_UINT32_(value) << PULSE1_CTRL_PC1_ACC_HOLD_Pos))
#define   PULSE1_CTRL_PC1_ACC_HOLD_DISABLED_Val      _UINT32_(0x0)                             /* (PULSE1_CTRL) Pulse accumulation registers continue to increment even if pulse generation is temporarily disabled */
#define   PULSE1_CTRL_PC1_ACC_HOLD_ENABLED_Val       _UINT32_(0x1)                             /* (PULSE1_CTRL) Pulse accumulation is held static */
#define PULSE1_CTRL_OPD_ENABLE_Pos                 _UINT32_(27)                                /* (PULSE1_CTRL) Open Drain Enable Position  */
#define PULSE1_CTRL_OPD_ENABLE_Msk                 (_UINT32_(0x1) << PULSE1_CTRL_OPD_ENABLE_Pos)   /* (PULSE1_CTRL) Open Drain Enable Mask  */
#define PULSE1_CTRL_OPD_ENABLE(value)              (PULSE1_CTRL_OPD_ENABLE_Msk & (_UINT32_(value) << PULSE1_CTRL_OPD_ENABLE_Pos))
#define   PULSE1_CTRL_OPD_ENABLE_DISABLED_Val        _UINT32_(0x0)                             /* (PULSE1_CTRL) The open drain is disabled */
#define   PULSE1_CTRL_OPD_ENABLE_ENABLED_Val         _UINT32_(0x1)                             /* (PULSE1_CTRL) The open drain is enabled */
#define PULSE1_CTRL_PC1_DETENT_Pos                 _UINT32_(28)                                /* (PULSE1_CTRL) Total Absolute Values for P and Q values Position  */
#define PULSE1_CTRL_PC1_DETENT_Msk                 (_UINT32_(0x3) << PULSE1_CTRL_PC1_DETENT_Pos)   /* (PULSE1_CTRL) Total Absolute Values for P and Q values Mask  */
#define PULSE1_CTRL_PC1_DETENT(value)              (PULSE1_CTRL_PC1_DETENT_Msk & (_UINT32_(value) << PULSE1_CTRL_PC1_DETENT_Pos))
#define   PULSE1_CTRL_PC1_DETENT_NET_Val             _UINT32_(0x0)                             /* (PULSE1_CTRL) Pulses generated based on (energy delivered ? energy generated) */
#define   PULSE1_CTRL_PC1_DETENT_ABSOLUTE_Val        _UINT32_(0x1)                             /* (PULSE1_CTRL) Pulses generated based on (energy delivered + energy generated) */
#define   PULSE1_CTRL_PC1_DETENT_DELIVERED_Val       _UINT32_(0x2)                             /* (PULSE1_CTRL) Pulses generated based on (energy delivered only) */
#define   PULSE1_CTRL_PC1_DETENT_GENERATED_Val       _UINT32_(0x3)                             /* (PULSE1_CTRL) Pulses generated based on (energy generated only) */
#define PULSE1_CTRL_PU_ENABLE_Pos                  _UINT32_(30)                                /* (PULSE1_CTRL) Pull-Up Enable Position  */
#define PULSE1_CTRL_PU_ENABLE_Msk                  (_UINT32_(0x1) << PULSE1_CTRL_PU_ENABLE_Pos)   /* (PULSE1_CTRL) Pull-Up Enable Mask  */
#define PULSE1_CTRL_PU_ENABLE(value)               (PULSE1_CTRL_PU_ENABLE_Msk & (_UINT32_(value) << PULSE1_CTRL_PU_ENABLE_Pos))
#define   PULSE1_CTRL_PU_ENABLE_DISABLED_Val         _UINT32_(0x0)                             /* (PULSE1_CTRL) Pull-Up disabled */
#define   PULSE1_CTRL_PU_ENABLE_ENABLED_Val          _UINT32_(0x1)                             /* (PULSE1_CTRL) Pull-Up enabled */
#define PULSE1_CTRL_PC1_ENABLE_Pos                 _UINT32_(31)                                /* (PULSE1_CTRL) Output Pulse Enable Position  */
#define PULSE1_CTRL_PC1_ENABLE_Msk                 (_UINT32_(0x1) << PULSE1_CTRL_PC1_ENABLE_Pos)   /* (PULSE1_CTRL) Output Pulse Enable Mask  */
#define PULSE1_CTRL_PC1_ENABLE(value)              (PULSE1_CTRL_PC1_ENABLE_Msk & (_UINT32_(value) << PULSE1_CTRL_PC1_ENABLE_Pos))
#define   PULSE1_CTRL_PC1_ENABLE_DISABLED_Val        _UINT32_(0x0)                             /* (PULSE1_CTRL) Pulse output disabled, inactive level determined by PULSE_POLARITY */
#define   PULSE1_CTRL_PC1_ENABLE_ENABLED_Val         _UINT32_(0x1)                             /* (PULSE1_CTRL) Pulse output enabled */

/* -------- PULSE1_K_t : (R/W  32) Pulse 1 Meter constant register -------- */
#define PULSE1_K_T_Pos                             _UINT32_(0)                                  /* (PULSE1_K_t) Pulse 1 Meter constant register */
#define PULSE1_K_T_Msk                             (_UINT32_(0xFFFFFFFF) << PULSE1_K_T_Pos)               /* (PULSE1_K_t) Pulse 1 Meter constant register */
#define PULSE1_K_T_Val(value)                      (PULSE1_K_T_Msk & (_UINT32_(value) << PULSE1_K_T_Pos))

/* -------- PULSE2_CTRL : (R/W  32) Pulse 2 control: enable/disable, polarity, quantity type selection -------- */
#define PULSE2_CTRL_PC2_WIDTH_Pos                  _UINT32_(0)                                 /* (PULSE2_CTRL) Pulse Width  */
#define PULSE2_CTRL_PC2_WIDTH_Msk                  (_UINT32_(0xFFFF) << PULSE2_CTRL_PC2_WIDTH_Pos)      /* (PULSE2_CTRL) Pulse Width  */
#define PULSE2_CTRL_PC2_WIDTH(value)               (PULSE2_CTRL_PC2_WIDTH_Msk & (_UINT32_(value) << PULSE2_CTRL_PC2_WIDTH_Pos))
#define PULSE2_CTRL_PC2_TYPE_Pos                  _UINT32_(16)                                 /* (PULSE2_CTRL) Pulse Type Selection Position */
#define PULSE2_CTRL_PC2_TYPE_Msk                  (_UINT32_(0xF) << PULSE2_CTRL_PC2_TYPE_Pos)      /* (PULSE2_CTRL) Pulse Type Selection Mask */
#define PULSE2_CTRL_PC2_TYPE(value)               (PULSE2_CTRL_PC2_TYPE_Msk & (_UINT32_(value) << PULSE2_CTRL_PC2_TYPE_Pos))
#define   PULSE2_CTRL_PC2_TYPE_P_T_Val              _UINT32_(0x0)                             /* (PULSE2_CTRL) Watt-hours, total all phases, fundamental + harmonics */
#define   PULSE2_CTRL_PC2_TYPE_P_T_F_Val            _UINT32_(0x1)                             /* (PULSE2_CTRL) Watt-hours, total all phases, fundamental only */
#define   PULSE2_CTRL_PC2_TYPE_Q_T_Val              _UINT32_(0x2)                             /* (PULSE2_CTRL) Var-hours, total all phases, fundamental + harmonics */
#define   PULSE2_CTRL_PC2_TYPE_Q_T_F_Val            _UINT32_(0x3)                             /* (PULSE2_CTRL) Var-hours, total all phases, fundamental only */
#define   PULSE2_CTRL_PC2_TYPE_I_T_Val              _UINT32_(0x4)                             /* (PULSE2_CTRL) Amp-squared-hours, total all phases, fundamental + harmonics */
#define   PULSE2_CTRL_PC2_TYPE_I_T_F_Val            _UINT32_(0x5)                             /* (PULSE2_CTRL) Amp-squared-hours, total all phases, fundamental only */
#define   PULSE2_CTRL_PC2_TYPE_S_T_Val              _UINT32_(0x6)                             /* (PULSE2_CTRL) VA-hours, total all phases, fundamental + harmonics. It is computed by multiplying Irms by Vrms */
#define   PULSE2_CTRL_PC2_TYPE_S_T_F_Val            _UINT32_(0x7)                             /* (PULSE2_CTRL) VA-hours, total all phases, fundamental only. It is computed by multiplying Irms (fundamental) by Vrms (fundamental) */
#define   PULSE2_CTRL_PC2_TYPE_S2_T_Val             _UINT32_(0x8)                             /* (PULSE2_CTRL) VA-hours, total all phases. It is computed as the square root of (P2+Q2) */
#define PULSE2_CTRL_PC2_POLARITY_Pos               _UINT32_(24)                                 /* (PULSE2_CTRL) Pulse Polarity Position  */
#define PULSE2_CTRL_PC2_POLARITY_Msk               (_UINT32_(0x1) << PULSE2_CTRL_PC2_POLARITY_Pos)      /* (PULSE2_CTRL) Pulse Polarity Mask  */
#define PULSE2_CTRL_PC2_POLARITY(value)            (PULSE2_CTRL_PC2_POLARITY_Msk & (_UINT32_(value) << PULSE2_CTRL_PC2_POLARITY_Pos))
#define   PULSE2_CTRL_PC2_POLARITY_LOW_Val           _UINT32_(0x0)                             /* (PULSE2_CTRL) Output pulse is low with width set by K_WIDTH, followed by an inactive level of high */
#define   PULSE2_CTRL_PC2_POLARITY_HIGH_Val          _UINT32_(0x1)                             /* (PULSE2_CTRL) Output pulse is high with width set by K_WIDTH, followed by an inactive level of low */
#define PULSE2_CTRL_PC2_OVERRIDE_Pos               _UINT32_(25)                                 /* (PULSE2_CTRL) Pulse Override Control Position  */
#define PULSE2_CTRL_PC2_OVERRIDE_Msk               (_UINT32_(0x1) << PULSE2_CTRL_PC2_OVERRIDE_Pos)      /* (PULSE2_CTRL) Pulse Override Control Mask  */
#define PULSE2_CTRL_PC2_OVERRIDE(value)            (PULSE2_CTRL_PC2_OVERRIDE_Msk & (_UINT32_(value) << PULSE2_CTRL_PC2_OVERRIDE_Pos))
#define   PULSE2_CTRL_PC2_OVERRIDE_ENABLED_Val       _UINT32_(0x0)                             /* (PULSE2_CTRL) Pulse generation functions as normal */
#define   PULSE2_CTRL_PC2_OVERRIDE_DISABLED_Val      _UINT32_(0x1)                             /* (PULSE2_CTRL) Pulse generation is temporarily disabled */
#define PULSE2_CTRL_PC2_ACC_HOLD_Pos               _UINT32_(26)                                 /* (PULSE2_CTRL) Pulse Accumulation Hold Control Position  */
#define PULSE2_CTRL_PC2_ACC_HOLD_Msk               (_UINT32_(0x1) << PULSE2_CTRL_PC2_ACC_HOLD_Pos)      /* (PULSE2_CTRL) Pulse Accumulation Hold Control Mask  */
#define PULSE2_CTRL_PC2_ACC_HOLD(value)            (PULSE2_CTRL_PC2_ACC_HOLD_Msk & (_UINT32_(value) << PULSE2_CTRL_PC2_ACC_HOLD_Pos))
#define   PULSE2_CTRL_PC2_ACC_HOLD_DISABLED_Val      _UINT32_(0x0)                             /* (PULSE2_CTRL) Pulse accumulation registers continue to increment even if pulse generation is temporarily disabled */
#define   PULSE2_CTRL_PC2_ACC_HOLD_ENABLED_Val       _UINT32_(0x1)                             /* (PULSE2_CTRL) Pulse accumulation is held static */
#define PULSE2_CTRL_OPD_ENABLE_Pos                 _UINT32_(27)                                /* (PULSE2_CTRL) Open Drain Enable Position  */
#define PULSE2_CTRL_OPD_ENABLE_Msk                 (_UINT32_(0x1) << PULSE2_CTRL_OPD_ENABLE_Pos)   /* (PULSE2_CTRL) Open Drain Enable Mask  */
#define PULSE2_CTRL_OPD_ENABLE(value)              (PULSE2_CTRL_OPD_ENABLE_Msk & (_UINT32_(value) << PULSE2_CTRL_OPD_ENABLE_Pos))
#define   PULSE2_CTRL_OPD_ENABLE_DISABLED_Val        _UINT32_(0x0)                             /* (PULSE2_CTRL) The open drain is disabled */
#define   PULSE2_CTRL_OPD_ENABLE_ENABLED_Val         _UINT32_(0x1)                             /* (PULSE2_CTRL) The open drain is enabled */
#define PULSE2_CTRL_PC2_DETENT_Pos                 _UINT32_(28)                                /* (PULSE2_CTRL) Total Absolute Values for P and Q values Position  */
#define PULSE2_CTRL_PC2_DETENT_Msk                 (_UINT32_(0x3) << PULSE2_CTRL_PC2_DETENT_Pos)   /* (PULSE2_CTRL) Total Absolute Values for P and Q values Mask  */
#define PULSE2_CTRL_PC2_DETENT(value)              (PULSE2_CTRL_PC2_DETENT_Msk & (_UINT32_(value) << PULSE2_CTRL_PC2_DETENT_Pos))
#define   PULSE2_CTRL_PC2_DETENT_NET_Val             _UINT32_(0x0)                             /* (PULSE2_CTRL) Pulses generated based on (energy delivered ? energy generated) */
#define   PULSE2_CTRL_PC2_DETENT_ABSOLUTE_Val        _UINT32_(0x1)                             /* (PULSE2_CTRL) Pulses generated based on (energy delivered + energy generated) */
#define   PULSE2_CTRL_PC2_DETENT_DELIVERED_Val       _UINT32_(0x2)                             /* (PULSE2_CTRL) Pulses generated based on (energy delivered only) */
#define   PULSE2_CTRL_PC2_DETENT_GENERATED_Val       _UINT32_(0x3)                             /* (PULSE2_CTRL) Pulses generated based on (energy generated only) */
#define PULSE2_CTRL_PU_ENABLE_Pos                  _UINT32_(30)                                /* (PULSE2_CTRL) Pull-Up Enable Position  */
#define PULSE2_CTRL_PU_ENABLE_Msk                  (_UINT32_(0x1) << PULSE2_CTRL_PU_ENABLE_Pos)   /* (PULSE2_CTRL) Pull-Up Enable Mask  */
#define PULSE2_CTRL_PU_ENABLE(value)               (PULSE2_CTRL_PU_ENABLE_Msk & (_UINT32_(value) << PULSE2_CTRL_PU_ENABLE_Pos))
#define   PULSE2_CTRL_PU_ENABLE_DISABLED_Val         _UINT32_(0x0)                             /* (PULSE2_CTRL) Pull-Up disabled */
#define   PULSE2_CTRL_PU_ENABLE_ENABLED_Val          _UINT32_(0x1)                             /* (PULSE2_CTRL) Pull-Up enabled */
#define PULSE2_CTRL_PC2_ENABLE_Pos                 _UINT32_(31)                                /* (PULSE2_CTRL) Output Pulse Enable Position  */
#define PULSE2_CTRL_PC2_ENABLE_Msk                 (_UINT32_(0x1) << PULSE2_CTRL_PC2_ENABLE_Pos)   /* (PULSE2_CTRL) Output Pulse Enable Mask  */
#define PULSE2_CTRL_PC2_ENABLE(value)              (PULSE2_CTRL_PC2_ENABLE_Msk & (_UINT32_(value) << PULSE2_CTRL_PC2_ENABLE_Pos))
#define   PULSE2_CTRL_PC2_ENABLE_DISABLED_Val        _UINT32_(0x0)                             /* (PULSE2_CTRL) Pulse output disabled, inactive level determined by PULSE_POLARITY */
#define   PULSE2_CTRL_PC2_ENABLE_ENABLED_Val         _UINT32_(0x1)                             /* (PULSE2_CTRL) Pulse output enabled */

/* -------- PULSE2_K_t : (R/W  32) Pulse 2 Meter constant register -------- */
#define PULSE2_K_T_Pos                             _UINT32_(0)                                  /* (PULSE2_K_t) Pulse 2 Meter constant register */
#define PULSE2_K_T_Msk                             (_UINT32_(0xFFFFFFFF) << PULSE2_K_T_Pos)               /* (PULSE2_K_t) Pulse 2 Meter constant register */
#define PULSE2_K_T_Val(value)                      (PULSE2_K_T_Msk & (_UINT32_(value) << PULSE2_K_T_Pos))

/* -------- SYNTHESIZER_ADDR : (R/W  32) Synthesizer Address Control  -------- */
#define SYNTHESIZER_ADDR_Pos                        _UINT32_(0)                                 /* (SYNTHESIZER_ADDR) Synthesizer Descriptor Address Position */
#define SYNTHESIZER_ADDR_Msk                        (_UINT32_(0xFFFFFFFF) << SYNTHESIZER_ADDR_Pos)      /* (SYNTHESIZER_ADDR) Synthesizer Descriptor Address Mask */
#define SYNTHESIZER_ADDR_Val(value)                 (SYNTHESIZER_ADDR_Msk & (_UINT32_(value) << SYNTHESIZER_ADDR_Pos))

/* -------- CREEP_THRESHOLD_Px :  (R/W  32) Creep Threshold for Active Energy (uQ2.30) -------- */
#define CREEP_THRESHOLD_Px_Pos                      _UINT32_(0)                                 /* (CREEP_THRESHOLD_Px) Creep Threshold for Active Energy Position */
#define CREEP_THRESHOLD_Px_Msk                      (_UINT32_(0xFFFFFFFF) << CREEP_THRESHOLD_Px_Pos)         /* (CREEP_THRESHOLD_Px) Creep Threshold for Active Energy Mask */
#define CREEP_THRESHOLD_Px_Val(value)               (CREEP_THRESHOLD_Px_Msk & (_UINT32_(value) << CREEP_THRESHOLD_Px_Pos))

/* -------- CREEP_THRESHOLD_Qx :  (R/W  32) Creep Threshold for Quadenergy (uQ2.30) -------- */
#define CREEP_THRESHOLD_Qx_Pos                      _UINT32_(0)                                 /* (CREEP_THRESHOLD_Qx) Creep Threshold for Quadenergy Position */
#define CREEP_THRESHOLD_Qx_Msk                      (_UINT32_(0xFFFFFFFF) << CREEP_THRESHOLD_Qx_Pos)         /* (CREEP_THRESHOLD_Qx) Creep Threshold for Quadenergy Mask */
#define CREEP_THRESHOLD_Qx_Val(value)               (CREEP_THRESHOLD_Qx_Msk & (_UINT32_(value) << CREEP_THRESHOLD_Qx_Pos))

/* -------- CREEP_THRESHOLD_Ix :  (R/W  32) Creep Threshold of Phase Current (uQ2.30) -------- */
#define CREEP_THRESHOLD_Ix_Pos                      _UINT32_(0)                                 /* (CREEP_THRESHOLD_Ix) Creep Threshold of Phase Current Position */
#define CREEP_THRESHOLD_Ix_Msk                      (_UINT32_(0xFFFFFFFF) << CREEP_THRESHOLD_Ix_Pos)         /* (CREEP_THRESHOLD_Ix) Creep Threshold of Phase Current Mask */
#define CREEP_THRESHOLD_Ix_Val(value)               (CREEP_THRESHOLD_Ix_Msk & (_UINT32_(value) << CREEP_THRESHOLD_Ix_Pos))

