Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_apps/prime_service_dual_metering_demo/src/config/pic32cx_mtsh_db_pl460_rf215/driver/metrology/drv_metrology_regs.h
/* -------- CREEP_THRESHOLD_S :  (R/W  32) Creep Threshold for Apparent Energy (uQ2.30) -------- */
#define CREEP_THRESHOLD_S_Pos                      _UINT32_(0)                                 /* (CREEP_THRESHOLD_S) Creep Threshold for Apparent Energy Position */
#define CREEP_THRESHOLD_S_Msk                      (_UINT32_(0xFFFFFFFF) << CREEP_THRESHOLD_S_Pos)         /* (CREEP_THRESHOLD_S) Creep Threshold for Apparent Energy Mask */
#define CREEP_THRESHOLD_S_Val(value)               (CREEP_THRESHOLD_S_Msk & (_UINT32_(value) << CREEP_THRESHOLD_S_Pos))

/* -------- POWER_OFFSET_CTRL :  (R/W  32) Power offset control -------- */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_A_Pos       _UINT32_(16)                                 /* (POWER_OFFSET_CTRL) Reactive Power Offset for Accumulator Quantities Enable Position */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_A_Msk       (_UINT32_(0x1) << POWER_OFFSET_CTRL_Q_OFFSET_ACC_A_Pos)         /* (POWER_OFFSET_CTRL) Reactive Power Offset for Accumulator Quantities Enable Mask */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_A(value)    (POWER_OFFSET_CTRL_Q_OFFSET_ACC_A_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_Q_OFFSET_ACC_A_Pos))
#define   POWER_OFFSET_CTRL_Q_OFFSET_ACC_A_DISABLED_Val        _UINT32_(0x0)                   /* (POWER_OFFSET_CTRL) Reactive Power Offset disabled */
#define   POWER_OFFSET_CTRL_Q_OFFSET_ACC_A_ENABLED_Val         _UINT32_(0x1)                   /* (POWER_OFFSET_CTRL) Reactive Power Offset enabled */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_B_Pos       _UINT32_(17)                                /* (POWER_OFFSET_CTRL) Reactive Power Offset for Accumulator Quantities Enable Position */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_B_Msk       (_UINT32_(0x1) << POWER_OFFSET_CTRL_Q_OFFSET_ACC_B_Pos)         /* (POWER_OFFSET_CTRL) Reactive Power Offset for Accumulator Quantities Enable Mask */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_B(value)    (POWER_OFFSET_CTRL_Q_OFFSET_ACC_B_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_Q_OFFSET_ACC_B_Pos))
#define   POWER_OFFSET_CTRL_Q_OFFSET_ACC_B_DISABLED_Val        _UINT32_(0x0)                   /* (POWER_OFFSET_CTRL) Reactive Power Offset disabled */
#define   POWER_OFFSET_CTRL_Q_OFFSET_ACC_B_ENABLED_Val         _UINT32_(0x1)                   /* (POWER_OFFSET_CTRL) Reactive Power Offset enabled */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_C_Pos       _UINT32_(18)                                /* (POWER_OFFSET_CTRL) Reactive Power Offset for Accumulator Quantities Enable Position */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_C_Msk       (_UINT32_(0x1) << POWER_OFFSET_CTRL_Q_OFFSET_ACC_C_Pos)         /* (POWER_OFFSET_CTRL) Reactive Power Offset for Accumulator Quantities Enable Mask */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_C(value)    (POWER_OFFSET_CTRL_Q_OFFSET_ACC_C_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_Q_OFFSET_ACC_C_Pos))
#define   POWER_OFFSET_CTRL_Q_OFFSET_ACC_C_DISABLED_Val        _UINT32_(0x0)                   /* (POWER_OFFSET_CTRL) Reactive Power Offset disabled */
#define   POWER_OFFSET_CTRL_Q_OFFSET_ACC_C_ENABLED_Val         _UINT32_(0x1)                   /* (POWER_OFFSET_CTRL) Reactive Power Offset enabled */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_A_Pos       _UINT32_(20)                                /* (POWER_OFFSET_CTRL) Active Power Offset for Accumulator Quantities Enable Position */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_A_Msk       (_UINT32_(0x1) << POWER_OFFSET_CTRL_P_OFFSET_ACC_A_Pos)         /* (POWER_OFFSET_CTRL) Active Power Offset for Accumulator Quantities Enable Mask */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_A(value)    (POWER_OFFSET_CTRL_P_OFFSET_ACC_A_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_P_OFFSET_ACC_A_Pos))
#define   POWER_OFFSET_CTRL_P_OFFSET_ACC_A_DISABLED_Val        _UINT32_(0x0)                   /* (POWER_OFFSET_CTRL) Active Power Offset disabled */
#define   POWER_OFFSET_CTRL_P_OFFSET_ACC_A_ENABLED_Val         _UINT32_(0x1)                   /* (POWER_OFFSET_CTRL) Active Power Offset enabled */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_B_Pos       _UINT32_(21)                                /* (POWER_OFFSET_CTRL) Active Power Offset for Accumulator Quantities Enable Position */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_B_Msk       (_UINT32_(0x1) << POWER_OFFSET_CTRL_P_OFFSET_ACC_B_Pos)         /* (POWER_OFFSET_CTRL) Active Power Offset for Accumulator Quantities Enable Mask */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_B(value)    (POWER_OFFSET_CTRL_P_OFFSET_ACC_B_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_P_OFFSET_ACC_B_Pos))
#define   POWER_OFFSET_CTRL_P_OFFSET_ACC_B_DISABLED_Val        _UINT32_(0x0)                   /* (POWER_OFFSET_CTRL) Active Power Offset disabled */
#define   POWER_OFFSET_CTRL_P_OFFSET_ACC_B_ENABLED_Val         _UINT32_(0x1)                   /* (POWER_OFFSET_CTRL) Active Power Offset enabled */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_C_Pos       _UINT32_(22)                                /* (POWER_OFFSET_CTRL) Active Power Offset for Accumulator Quantities Enable Position */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_C_Msk       (_UINT32_(0x1) << POWER_OFFSET_CTRL_P_OFFSET_ACC_C_Pos)         /* (POWER_OFFSET_CTRL) Active Power Offset for Accumulator Quantities Enable Mask */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_C(value)    (POWER_OFFSET_CTRL_P_OFFSET_ACC_C_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_P_OFFSET_ACC_C_Pos))
#define   POWER_OFFSET_CTRL_P_OFFSET_ACC_C_DISABLED_Val        _UINT32_(0x0)                   /* (POWER_OFFSET_CTRL) Active Power Offset disabled */
#define   POWER_OFFSET_CTRL_P_OFFSET_ACC_C_ENABLED_Val         _UINT32_(0x1)                   /* (POWER_OFFSET_CTRL) Active Power Offset enabled */
#define POWER_OFFSET_CTRL_S_OFFSET_PUL_Pos         _UINT32_(24)                                /* (POWER_OFFSET_CTRL) Apparent Power Offset for Pulse Quantities Enable Position */
#define POWER_OFFSET_CTRL_S_OFFSET_PUL_Msk         (_UINT32_(0x1) << POWER_OFFSET_CTRL_S_OFFSET_PUL_Pos)        /* (POWER_OFFSET_CTRL) Apparent Power Offset for Pulse Quantities Enable Mask */
#define POWER_OFFSET_CTRL_S_OFFSET_PUL(value)      (POWER_OFFSET_CTRL_S_OFFSET_PUL_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_S_OFFSET_PUL_Pos))
#define   POWER_OFFSET_CTRL_S_OFFSET_PUL_DISABLED_Val      _UINT32_(0x0)                            /* (POWER_OFFSET_CTRL) Apparent Power Offset for Pulse Quantities Enable disabled */
#define   POWER_OFFSET_CTRL_S_OFFSET_PUL_ENABLED_Val       _UINT32_(0x1)                            /* (POWER_OFFSET_CTRL) Apparent Power Offset for Pulse Quantities Enable enabled */
#define POWER_OFFSET_CTRL_Q_OFFSET_PUL_Pos         _UINT32_(27)                                /* (POWER_OFFSET_CTRL) Reactive Power Offset for Pulse Quantities Enable Position */
#define POWER_OFFSET_CTRL_Q_OFFSET_PUL_Msk         (_UINT32_(0x1) << POWER_OFFSET_CTRL_Q_OFFSET_PUL_Pos)        /* (POWER_OFFSET_CTRL) Reactive Power Offset for Pulse Quantities Enable Mask */
#define POWER_OFFSET_CTRL_Q_OFFSET_PUL(value)      (POWER_OFFSET_CTRL_Q_OFFSET_PUL_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_Q_OFFSET_PUL_Pos))
#define   POWER_OFFSET_CTRL_Q_OFFSET_PUL_DISABLED_Val      _UINT32_(0x0)                            /* (POWER_OFFSET_CTRL) Reactive Power Offset for Pulse Quantities Enable disabled */
#define   POWER_OFFSET_CTRL_Q_OFFSET_PUL_ENABLED_Val       _UINT32_(0x1)                            /* (POWER_OFFSET_CTRL) Reactive Power Offset for Pulse Quantities Enable enabled */
#define POWER_OFFSET_CTRL_P_OFFSET_PUL_Pos         _UINT32_(31)                                /* (POWER_OFFSET_CTRL) Active Power Offset for Pulse Quantities Enable Position */
#define POWER_OFFSET_CTRL_P_OFFSET_PUL_Msk         (_UINT32_(0x1) << POWER_OFFSET_CTRL_P_OFFSET_PUL_Pos)        /* (POWER_OFFSET_CTRL) Active Power Offset for Pulse Quantities Enable Mask */
#define POWER_OFFSET_CTRL_P_OFFSET_PUL(value)      (POWER_OFFSET_CTRL_P_OFFSET_PUL_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_P_OFFSET_PUL_Pos))
#define   POWER_OFFSET_CTRL_P_OFFSET_PUL_DISABLED_Val      _UINT32_(0x0)                            /* (POWER_OFFSET_CTRL) Active Power Offset for Pulse Quantities Enable disabled */
#define   POWER_OFFSET_CTRL_P_OFFSET_PUL_ENABLED_Val       _UINT32_(0x1)                            /* (POWER_OFFSET_CTRL) Active Power Offset for Pulse Quantities Enable enabled */

/* -------- POWER_OFFSET_P :  (R/W  32) Active Power Offset (sQ1.30) -------- */
#define POWER_OFFSET_P_Pos                         _UINT32_(0)                                 /* (POWER_OFFSET_P) Active Power Offset Position */
#define POWER_OFFSET_P_Msk                         (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_P_Pos)         /* (POWER_OFFSET_P) Active Power Offset Mask */
#define POWER_OFFSET_P_Val(value)                  (POWER_OFFSET_P_Msk & (_UINT32_(value) << POWER_OFFSET_P_Pos))

/* -------- POWER_OFFSET_Q :  (R/W  32) Active Power Offset (sQ1.30) -------- */
#define POWER_OFFSET_Q_Pos                         _UINT32_(0)                                 /* (POWER_OFFSET_Q) Active Power Offset Position */
#define POWER_OFFSET_Q_Msk                         (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_Q_Pos)         /* (POWER_OFFSET_Q) Active Power Offset Mask */
#define POWER_OFFSET_Q_Val(value)                  (POWER_OFFSET_Q_Msk & (_UINT32_(value) << POWER_OFFSET_Q_Pos))

/* -------- POWER_OFFSET_S :  (R/W  32) Apparent Power Offset (sQ1.30) -------- */
#define POWER_OFFSET_S_Pos                         _UINT32_(0)                                 /* (POWER_OFFSET_S) Apparent Power Offset Position */
#define POWER_OFFSET_S_Msk                         (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_S_Pos)         /* (POWER_OFFSET_S) Apparent Power Offset Mask */
#define POWER_OFFSET_S_Val(value)                  (POWER_OFFSET_S_Msk & (_UINT32_(value) << POWER_OFFSET_S_Pos))

/* -------- SWELL_THRESHOLD_Vx :  (R/W  32) Voltage swell threshold for each half cycle of voltage (uQ0.32) -------- */
#define SWELL_THRESHOLD_Vx_Pos                     _UINT32_(0)                                 /* (SWELL_THRESHOLD_Vx) Voltage swell threshold Position */
#define SWELL_THRESHOLD_Vx_Msk                     (_UINT32_(0xFFFFFFFF) << SWELL_THRESHOLD_Vx_Pos)         /* (SWELL_THRESHOLD_Vx) Voltage swell threshold Mask */
#define SWELL_THRESHOLD_Vx_Val(value)              (SWELL_THRESHOLD_Vx_Msk & (_UINT32_(value) << SWELL_THRESHOLD_Vx_Pos))

/* -------- SAG_THRESHOLD_Vx :  (R/W  32) Voltage sag threshold for each half cycle of voltage (uQ0.32) -------- */
#define SAG_THRESHOLD_Vx_Pos                     _UINT32_(0)                                 /* (SAG_THRESHOLD_Vx) Voltage sag threshold Position */
#define SAG_THRESHOLD_Vx_Msk                     (_UINT32_(0xFFFFFFFF) << SAG_THRESHOLD_Vx_Pos)         /* (SAG_THRESHOLD_Vx) Voltage sag threshold Mask */
#define SAG_THRESHOLD_Vx_Val(value)              (SAG_THRESHOLD_Vx_Msk & (_UINT32_(value) << SAG_THRESHOLD_Vx_Pos))

/* -------- INTERRUPT_THRESHOLD_Vx :  (R/W  32) Interrupt threshold for each half cycle of voltage (uQ0.32) -------- */
#define INTERRUPT_THRESHOLD_Vx_Pos               _UINT32_(0)                                 /* (INTERRUPT_THRESHOLD_Vx) Interrupt threshold Position */
#define INTERRUPT_THRESHOLD_Vx_Msk               (_UINT32_(0xFFFFFFFF) << INTERRUPT_THRESHOLD_Vx_Pos)         /* (INTERRUPT_THRESHOLD_Vx) Interrupt threshold Mask */
#define INTERRUPT_THRESHOLD_Vx_Val(value)        (INTERRUPT_THRESHOLD_Vx_Msk & (_UINT32_(value) << INTERRUPT_THRESHOLD_Vx_Pos))

/* -------- K_xx :  (R/W  32) Current/Volatge Conversion Factor (uQ22.10) -------- */
#define K_xx_Pos                                 _UINT32_(0)                                 /* (K_xx) Current/Volatge Conversion Factor Position */
#define K_xx_Msk                                 (_UINT32_(0xFFFFFFFF) << K_xx_Pos)          /* (K_xx) Current/Volatge Conversion Factor Mask */
#define K_xx_Val(value)                          (K_xx_Msk & (_UINT32_(value) << K_xx_Pos))

/* -------- CAL_M_xx :  (R/W  32) Current/Volatge magnitude calibration constant (sQ2.29) -------- */
#define CAL_M_xx_Pos                             _UINT32_(0)                                 /* (CAL_M_xx) Current/Volatge magnitude calibration constant Position */
#define CAL_M_xx_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_M_xx_Pos)      /* (CAL_M_xx) Current/Volatge magnitude calibration constant Mask */
#define CAL_M_xx_Val(value)                      (CAL_M_xx_Msk & (_UINT32_(value) << CAL_M_xx_Pos))

/* -------- CAL_PH_xx :  (R/W  32) Current/Volatge phase calibration constant (sQ0.31) -------- */
#define CAL_PH_xx_Pos                             _UINT32_(0)                                 /* (CAL_PH_xx) Current/Volatge phase calibration constant Position */
#define CAL_PH_xx_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_PH_xx_Pos)      /* (CAL_PH_xx) Current/Volatge phase calibration constant Mask */
#define CAL_PH_xx_Val(value)                      (CAL_PH_xx_Msk & (_UINT32_(value) << CAL_PH_xx_Pos))

/* -------- CAPTURE_CTRL :  (R/W  32) Waveform capture control register -------- */
#define CAPTURE_CTRL_CAPTURE_TYPE_Pos             _UINT32_(0)                                 /* (CAPTURE_CTRL) Waveform capture control register Position */
#define CAPTURE_CTRL_CAPTURE_TYPE_Msk             (_UINT32_(0x3) << CAPTURE_CTRL_CAPTURE_TYPE_Pos)         /* (CAPTURE_CTRL) Waveform capture control register Mask */
#define CAPTURE_CTRL_CAPTURE_TYPE(value)          (CAPTURE_CTRL_CAPTURE_TYPE_Msk & (_UINT32_(value) << CAPTURE_CTRL_CAPTURE_TYPE_Pos))
#define   CAPTURE_CTRL_CAPTURE_TYPE_ONE_SHOT_Val    _UINT32_(0x0)                   /* (CAPTURE_CTRL) Capture will stop after capture finishes or is disabled */
#define   CAPTURE_CTRL_CAPTURE_TYPE_CONTINUOS_Val   _UINT32_(0x1)                   /* (CAPTURE_CTRL) Continuous capture of waveform data in circular-buffer fashion */
#define CAPTURE_CTRL_CAPTURE_SOURCE_Pos           _UINT32_(4)                                 /* (CAPTURE_CTRL) Capture Source Select Position */
#define CAPTURE_CTRL_CAPTURE_SOURCE_Msk           (_UINT32_(0x7) << CAPTURE_CTRL_CAPTURE_SOURCE_Pos)         /* (CAPTURE_CTRL) Capture Source Select Mask */
#define CAPTURE_CTRL_CAPTURE_SOURCE(value)        (CAPTURE_CTRL_CAPTURE_SOURCE_Msk & (_UINT32_(value) << CAPTURE_CTRL_CAPTURE_SOURCE_Pos))
#define   CAPTURE_CTRL_CAPTURE_SOURCE_16KHz_Val     _UINT32_(0x0)                   /* (CAPTURE_CTRL) Capture 16kHz data [sQ1.30] before DSP filtering */
#define   CAPTURE_CTRL_CAPTURE_SOURCE_4KHz_FBW_Val  _UINT32_(0x1)                   /* (CAPTURE_CTRL) Capture 4kHz FBW data [sQ2.29] (Full Bandwidth = fundamental + harmonics) */
#define   CAPTURE_CTRL_CAPTURE_SOURCE_4KHz_NBW_Val  _UINT32_(0x2)                   /* (CAPTURE_CTRL) Capture 4kHz NBW data [sQ2.29] (Narrow Bandwidth = fundamental only) */
#define   CAPTURE_CTRL_CAPTURE_SOURCE_8KHz_FBW_Val  _UINT32_(0x3)                   /* (CAPTURE_CTRL) Capture 8kHz FBW data [sQ2.29] (Full Bandwidth = fundamental + harmonics) */
#define CAPTURE_CTRL_CH_SEL_IA_Pos                _UINT32_(8)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_IA_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_IA_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_IA(value)             (CAPTURE_CTRL_CH_SEL_IA_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_IA_Pos))
#define   CAPTURE_CTRL_CH_SEL_IA_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_IA_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_VA_Pos                _UINT32_(9)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_VA_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_VA_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_VA(value)             (CAPTURE_CTRL_CH_SEL_VA_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_VA_Pos))
#define   CAPTURE_CTRL_CH_SEL_VA_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_VA_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_IB_Pos                _UINT32_(10)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_IB_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_IB_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_IB(value)             (CAPTURE_CTRL_CH_SEL_IB_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_IB_Pos))
#define   CAPTURE_CTRL_CH_SEL_IB_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_IB_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_VB_Pos                _UINT32_(11)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_VB_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_VB_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_VB(value)             (CAPTURE_CTRL_CH_SEL_VB_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_VB_Pos))
#define   CAPTURE_CTRL_CH_SEL_VB_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_VB_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_IC_Pos                _UINT32_(12)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_IC_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_IC_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_IC(value)             (CAPTURE_CTRL_CH_SEL_IC_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_IC_Pos))
#define   CAPTURE_CTRL_CH_SEL_IC_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_IC_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_VC_Pos                _UINT32_(13)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_VC_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_VC_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_VC(value)             (CAPTURE_CTRL_CH_SEL_VC_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_VC_Pos))
#define   CAPTURE_CTRL_CH_SEL_VC_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_VC_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_IN_Pos                _UINT32_(14)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_IN_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_IN_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_IN(value)             (CAPTURE_CTRL_CH_SEL_IN_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_IN_Pos))
#define   CAPTURE_CTRL_CH_SEL_IN_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_IN_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_VD_Pos                _UINT32_(15)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_VD_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_VD_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_VD(value)             (CAPTURE_CTRL_CH_SEL_VD_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_VD_Pos))
#define   CAPTURE_CTRL_CH_SEL_VD_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_VD_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CAPTURE_EN_Pos                _UINT32_(31)                                 /* (CAPTURE_CTRL) Enable waveform capture Position */
#define CAPTURE_CTRL_CAPTURE_EN_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CAPTURE_EN_Pos)         /* (CAPTURE_CTRL) Enable waveform capture Mask */
#define CAPTURE_CTRL_CAPTURE_EN(value)             (CAPTURE_CTRL_CAPTURE_EN_Msk & (_UINT32_(value) << CAPTURE_CTRL_CAPTURE_EN_Pos))
#define   CAPTURE_CTRL_CAPTURE_EN_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture feature is disabled  */
#define   CAPTURE_CTRL_CAPTURE_EN_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture feature is enabled */

