Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_apps/prime_service_dual_metering_demo/src/config/pic32cx_mtsh_db_pl460_rf215/driver/metrology/drv_metrology_regs.h
/* -------- CAPTURE_BUFF_SIZE :  (R/W  32) Waveform capture buffer size in units of 32-bits -------- */
#define CAPTURE_BUFF_SIZE_Pos                      _UINT32_(0)                                 /* (CAPTURE_BUFF_SIZE) Waveform capture buffer size Position */
#define CAPTURE_BUFF_SIZE_Msk                      (_UINT32_(0xFFFFFF) << CAPTURE_BUFF_SIZE_Pos)      /* (CAPTURE_BUFF_SIZE) Waveform capture buffer size Mask */
#define CAPTURE_BUFF_SIZE_Val(value)               (CAPTURE_BUFF_SIZE_Msk & (_UINT32_(value) << CAPTURE_BUFF_SIZE_Pos))

/* -------- CAPTURE_ADDR :  (R/W  32) Waveform capture buffer address pointer -------- */
#define CAPTURE_ADDR_Pos                           _UINT32_(0)                                 /* (CAPTURE_ADDR) Waveform capture buffer address pointer Position */
#define CAPTURE_ADDR_Msk                           (_UINT32_(0xFFFFFFFF) << CAPTURE_ADDR_Pos)      /* (CAPTURE_ADDR) Waveform capture buffer address pointer Mask */
#define CAPTURE_ADDR_Val(value)                    (CAPTURE_ADDR_Msk & (_UINT32_(value) << CAPTURE_ADDR_Pos))

/* -------- AFE_CTRL :  (R/W  32) ATSENSE control  -------- */
#define AFE_CTRL_I0_GAIN_Pos              _UINT32_(0)                                 /* (AFE_CTRL) Channel I0 gain Position */
#define AFE_CTRL_I0_GAIN_Msk              (_UINT32_(0x3) << AFE_CTRL_I0_GAIN_Pos)         /* (AFE_CTRL) Channel I0 gain Mask */
#define AFE_CTRL_I0_GAIN(value)           (AFE_CTRL_I0_GAIN_Msk & (_UINT32_(value) << AFE_CTRL_I0_GAIN_Pos))
#define   AFE_CTRL_I0_GAIN_1_Val            _UINT32_(0x0)                   /* (AFE_CTRL) Channel has a gain of 1  */
#define   AFE_CTRL_I0_GAIN_2_Val            _UINT32_(0x1)                   /* (AFE_CTRL) Channel has a gain of 2 */
#define   AFE_CTRL_I0_GAIN_4_Val            _UINT32_(0x2)                   /* (AFE_CTRL) Channel has a gain of 4 */
#define   AFE_CTRL_I0_GAIN_8_Val            _UINT32_(0x3)                   /* (AFE_CTRL) Channel has a gain of 8 */
#define AFE_CTRL_I1_GAIN_Pos              _UINT32_(2)                                /* (AFE_CTRL) Channel I1 gain Position */
#define AFE_CTRL_I1_GAIN_Msk              (_UINT32_(0x3) << AFE_CTRL_I1_GAIN_Pos)         /* (AFE_CTRL) Channel I1 gain Mask */
#define AFE_CTRL_I1_GAIN(value)           (AFE_CTRL_I1_GAIN_Msk & (_UINT32_(value) << AFE_CTRL_I1_GAIN_Pos))
#define   AFE_CTRL_I1_GAIN_1_Val            _UINT32_(0x0)                   /* (AFE_CTRL) Channel has a gain of 1  */
#define   AFE_CTRL_I1_GAIN_2_Val            _UINT32_(0x1)                   /* (AFE_CTRL) Channel has a gain of 2 */
#define   AFE_CTRL_I1_GAIN_4_Val            _UINT32_(0x2)                   /* (AFE_CTRL) Channel has a gain of 4 */
#define   AFE_CTRL_I1_GAIN_8_Val            _UINT32_(0x3)                   /* (AFE_CTRL) Channel has a gain of 8 */
#define AFE_CTRL_I2_GAIN_Pos              _UINT32_(4)                                /* (AFE_CTRL) Channel I2 gain Position */
#define AFE_CTRL_I2_GAIN_Msk              (_UINT32_(0x3) << AFE_CTRL_I2_GAIN_Pos)         /* (AFE_CTRL) Channel I2 gain Mask */
#define AFE_CTRL_I2_GAIN(value)           (AFE_CTRL_I2_GAIN_Msk & (_UINT32_(value) << AFE_CTRL_I2_GAIN_Pos))
#define   AFE_CTRL_I2_GAIN_1_Val            _UINT32_(0x0)                   /* (AFE_CTRL) Channel has a gain of 1  */
#define   AFE_CTRL_I2_GAIN_2_Val            _UINT32_(0x1)                   /* (AFE_CTRL) Channel has a gain of 2 */
#define   AFE_CTRL_I2_GAIN_4_Val            _UINT32_(0x2)                   /* (AFE_CTRL) Channel has a gain of 4 */
#define   AFE_CTRL_I2_GAIN_8_Val            _UINT32_(0x3)                   /* (AFE_CTRL) Channel has a gain of 8 */
#define AFE_CTRL_I3_GAIN_Pos              _UINT32_(6)                                /* (AFE_CTRL) Channel I2 gain Position */
#define AFE_CTRL_I3_GAIN_Msk              (_UINT32_(0x3) << AFE_CTRL_I3_GAIN_Pos)         /* (AFE_CTRL) Channel I2 gain Mask */
#define AFE_CTRL_I3_GAIN(value)           (AFE_CTRL_I3_GAIN_Msk & (_UINT32_(value) << AFE_CTRL_I3_GAIN_Pos))
#define   AFE_CTRL_I3_GAIN_1_Val            _UINT32_(0x0)                   /* (AFE_CTRL) Channel has a gain of 1  */
#define   AFE_CTRL_I3_GAIN_2_Val            _UINT32_(0x1)                   /* (AFE_CTRL) Channel has a gain of 2 */
#define   AFE_CTRL_I3_GAIN_4_Val            _UINT32_(0x2)                   /* (AFE_CTRL) Channel has a gain of 4 */
#define   AFE_CTRL_I3_GAIN_8_Val            _UINT32_(0x3)                   /* (AFE_CTRL) Channel has a gain of 8 */

/* -------- AFE_CTRL :  (R/W  32) MCP control -------- */
#define AFE_CTRL_CHNx_PGA_Pos              _UINT32_(0)                                 /* (AFE_CTRL) Channel gain Position */
#define AFE_CTRL_CHNx_PGA_Msk              (_UINT32_(0x3) << AFE_CTRL_CHNx_PGA_Pos)         /* (AFE_CTRL) Channel gain Mask */
#define AFE_CTRL_CHNx_PGA(channel, value)      ((AFE_CTRL_CHNx_PGA_Msk & (_UINT32_(value) << AFE_CTRL_CHNx_PGA_Pos)) << (3 * channel))
#define   AFE_CTRL_CHNx_PGA_1_Val            _UINT32_(0x0)                   /* (AFE_CTRL) Channel has a gain of 1  */
#define   AFE_CTRL_CHNx_PGA_2_Val            _UINT32_(0x1)                   /* (AFE_CTRL) Channel has a gain of 2 */
#define   AFE_CTRL_CHNx_PGA_4_Val            _UINT32_(0x2)                   /* (AFE_CTRL) Channel has a gain of 4 */
#define   AFE_CTRL_CHNx_PGA_8_Val            _UINT32_(0x3)                   /* (AFE_CTRL) Channel has a gain of 8 */
#define   AFE_CTRL_CHNx_PGA_16_Val           _UINT32_(0x4)                   /* (AFE_CTRL) Channel has a gain of 16 */
#define   AFE_CTRL_CHNx_PGA_32_Val           _UINT32_(0x5)                   /* (AFE_CTRL) Channel has a gain of 32 */
#define AFE_CTRL_BOOST_Pos                 _UINT32_(24)                                /* (AFE_CTRL) Bias Current Selection Position */
#define AFE_CTRL_BOOST_Msk                 (_UINT32_(0x2) << AFE_CTRL_BOOST_Pos)         /* (AFE_CTRL) Bias Current Selection Mask */
#define AFE_CTRL_BOOST(value)              (AFE_CTRL_BOOST_Msk & (_UINT32_(value) << AFE_CTRL_BOOST_Pos))
#define   AFE_CTRL_BOOST_05_Val              _UINT32_(0x0)                   /* (AFE_CTRL) All channels have current x 0.5  */
#define   AFE_CTRL_BOOST_066_Val             _UINT32_(0x1)                   /* (AFE_CTRL) All channels have current x 0.66 */
#define   AFE_CTRL_BOOST_1_Val               _UINT32_(0x2)                   /* (AFE_CTRL) All channels have current x 1 */
#define   AFE_CTRL_BOOST_2_Val               _UINT32_(0x3)                   /* (AFE_CTRL) All channels have current x 2 */
#define AFE_CTRL_DITHER_Pos                 _UINT32_(26)                                /* (AFE_CTRL) Dithering Circuit Position */
#define AFE_CTRL_DITHER_Msk                 (_UINT32_(0x2) << AFE_CTRL_DITHER_Pos)         /* (AFE_CTRL) Dithering Circuit Mask */
#define AFE_CTRL_DITHER(value)              (AFE_CTRL_DITHER_Msk & (_UINT32_(value) << AFE_CTRL_DITHER_Pos))
#define   AFE_CTRL_DITHER_OFF_Val              _UINT32_(0x0)                   /* (AFE_CTRL) Dithering turned off  */
#define   AFE_CTRL_DITHER_ON_MIN_Val           _UINT32_(0x1)                   /* (AFE_CTRL) Dithering turned on. Strength min. */
#define   AFE_CTRL_DITHER_ON_MED_Val           _UINT32_(0x2)                   /* (AFE_CTRL) Dithering turned on. Strength med. */
#define   AFE_CTRL_DITHER_ON_MAX_Val           _UINT32_(0x3)                   /* (AFE_CTRL) Dithering turned on. Strength max. */

/* -------- POWER_OFFSET_P_A :  (R/W  32) Phase-A active power offset (sQ9.40) -------- */
#define POWER_OFFSET_P_A_Pos                        _UINT32_(0)                                 /* (POWER_OFFSET_P_A) Phase-A active power offset Position */
#define POWER_OFFSET_P_A_Msk                        (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_P_A_Pos)      /* (POWER_OFFSET_P_A) Phase-A active power offset Mask */
#define POWER_OFFSET_P_A_Val(value)                 (POWER_OFFSET_P_A_Msk & (_UINT32_(value) << POWER_OFFSET_P_A_Pos))

/* -------- POWER_OFFSET_P_B :  (R/W  32) Phase-B active power offset (sQ9.40) -------- */
#define POWER_OFFSET_P_B_Pos                        _UINT32_(0)                                 /* (POWER_OFFSET_P_B) Phase-B active power offset Position */
#define POWER_OFFSET_P_B_Msk                        (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_P_B_Pos)      /* (POWER_OFFSET_P_B) Phase-B active power offset Mask */
#define POWER_OFFSET_P_B_Val(value)                 (POWER_OFFSET_P_B_Msk & (_UINT32_(value) << POWER_OFFSET_P_B_Pos))

