Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_apps/prime_service_dual_metering_demo/src/config/pic32cx_mtsh_db_pl460_rf215/driver/metrology/drv_metrology_regs.h
/* -------- POWER_OFFSET_P_C :  (R/W  32) Phase-C active power offset (sQ9.40) -------- */
#define POWER_OFFSET_P_C_Pos                        _UINT32_(0)                                 /* (POWER_OFFSET_P_C) Phase-C active power offset Position */
#define POWER_OFFSET_P_C_Msk                        (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_P_C_Pos)      /* (POWER_OFFSET_P_C) Phase-C active power offset Mask */
#define POWER_OFFSET_P_C_Val(value)                 (POWER_OFFSET_P_C_Msk & (_UINT32_(value) << POWER_OFFSET_P_C_Pos))

/* -------- POWER_OFFSET_Q_A :  (R/W  32) Phase-A reactive power offset (sQ9.40) -------- */
#define POWER_OFFSET_Q_A_Pos                        _UINT32_(0)                                 /* (POWER_OFFSET_Q_A) Phase-A reactive power offset Position */
#define POWER_OFFSET_Q_A_Msk                        (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_Q_A_Pos)      /* (POWER_OFFSET_Q_A) Phase-A reactive power offset Mask */
#define POWER_OFFSET_Q_A_Val(value)                 (POWER_OFFSET_Q_A_Msk & (_UINT32_(value) << POWER_OFFSET_Q_A_Pos))

/* -------- POWER_OFFSET_Q_B :  (R/W  32) Phase-B reactive power offset (sQ9.40) -------- */
#define POWER_OFFSET_Q_B_Pos                        _UINT32_(0)                                 /* (POWER_OFFSET_Q_B) Phase-B reactive power offset Position */
#define POWER_OFFSET_Q_B_Msk                        (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_Q_B_Pos)      /* (POWER_OFFSET_Q_B) Phase-B reactive power offset Mask */
#define POWER_OFFSET_Q_B_Val(value)                 (POWER_OFFSET_Q_B_Msk & (_UINT32_(value) << POWER_OFFSET_Q_B_Pos))

/* -------- POWER_OFFSET_Q_C :  (R/W  32) Phase-C reactive power offset (sQ9.40) -------- */
#define POWER_OFFSET_Q_C_Pos                        _UINT32_(0)                                 /* (POWER_OFFSET_Q_C) Phase-C reactive power offset Position */
#define POWER_OFFSET_Q_C_Msk                        (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_Q_C_Pos)      /* (POWER_OFFSET_Q_C) Phase-C reactive power offset Mask */
#define POWER_OFFSET_Q_C_Val(value)                 (POWER_OFFSET_Q_C_Msk & (_UINT32_(value) << POWER_OFFSET_Q_C_Pos))

/* -------- VERSION :  (R/W  32) Metrology Version -------- */
#define VERSION_FIRMWARE_REV_Pos                    _UINT32_(0)                                 /* (VERSION) Firmware Revision Position */
#define VERSION_FIRMWARE_REV_Msk                    (_UINT32_(0xFF) << VERSION_FIRMWARE_REV_Pos)      /* (VERSION) Firmware Revision Mask */
#define VERSION_FIRMWARE_REV(value)                 (VERSION_FIRMWARE_REV_Msk & (_UINT32_(value) << VERSION_FIRMWARE_REV_Pos))
#define VERSION_FIRMWARE_MINOR_REV_Pos              _UINT32_(8)                                 /* (VERSION) Minor Firmware Revision Position */
#define VERSION_FIRMWARE_MINOR_REV_Msk              (_UINT32_(0xFF) << VERSION_FIRMWARE_MINOR_REV_Pos)      /* (VERSION) Minor Firmware Revision Mask */
#define VERSION_FIRMWARE_MINOR_REV(value)           (VERSION_FIRMWARE_MINOR_REV_Msk & (_UINT32_(value) << VERSION_FIRMWARE_MINOR_REV_Pos))
#define VERSION_FIRMWARE_MAJOR_REV_Pos              _UINT32_(8)                                 /* (VERSION) Major  Firmware Revision Position */
#define VERSION_FIRMWARE_MAJOR_REV_Msk              (_UINT32_(0xFF) << VERSION_FIRMWARE_MAJOR_REV_Pos)      /* (VERSION) Major  Firmware Revision Mask */
#define VERSION_FIRMWARE_MAJOR_REV(value)           (VERSION_FIRMWARE_MAJOR_REV_Msk & (_UINT32_(value) << VERSION_FIRMWARE_MAJOR_REV_Pos))

/* -------- STATUS :  (R/W  32) Metrology status -------- */
#define STATUS_STATUS_Pos                           _UINT32_(0)                       /* (STATUS) Metrology status Position */
#define STATUS_STATUS_Msk                           (_UINT32_(0x0F) << STATUS_STATUS_Pos)      /* (STATUS) Metrology status Mask */
#define STATUS_STATUS(value)                        (STATUS_STATUS_Msk & (_UINT32_(value) << STATUS_STATUS_Pos))
#define   STATUS_STATUS_HALT                        _UINT32_(0x0)                   /* (STATUS) Metrology module is halted */
#define   STATUS_STATUS_RESET                       _UINT32_(0x1)                   /* (STATUS) Resetting metrology module */
#define   STATUS_STATUS_INIT_DSP                    _UINT32_(0x2)                   /* (STATUS) Initializing DSP filters */
#define   STATUS_STATUS_DSP_READY                   _UINT32_(0x3)                   /* (STATUS) DSP filters have been initialized */
#define   STATUS_STATUS_INIT_ATSENSE                _UINT32_(0x4)                   /* (STATUS) Initializing ATSENSE */
#define   STATUS_STATUS_ATSENSE_READY               _UINT32_(0x5)                   /* (STATUS) ATSENSE has been initialized */
#define   STATUS_STATUS_READY                       _UINT32_(0x6)                   /* (STATUS) ATSENSE temperature configuration & calibration data has been copied into output registers */
#define   STATUS_STATUS_DSP_SETTLING                _UINT32_(0x7)                   /* (STATUS) Waiting for DSP filters to stabilize to full accuracy */
#define   STATUS_STATUS_DSP_RUNNING                 _UINT32_(0x8)                   /* (STATUS) DSP filters have stabilized to full accuracy */

/* -------- STATUS :  (R/W  32) Metrology state flags -------- */
#define STATUS_STATE_FLAG_PH_A_ACTIVE_Pos           _UINT32_(0)                       /* (STATUS) Phase A active Position */
#define STATUS_STATE_FLAG_PH_A_ACTIVE_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_PH_A_ACTIVE_Pos)      /* (STATUS) Phase A active Mask */
#define STATUS_STATE_FLAG_PH_A_ACTIVE(value)        (STATUS_STATE_FLAG_PH_A_ACTIVE_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_PH_A_ACTIVE_Pos))
#define   STATUS_STATE_FLAG_PH_A_ACTIVE_INACTIVE_Val  _UINT32_(0x0)                   /* (STATUS) Voltage phase A is inactive  */
#define   STATUS_STATE_FLAG_PH_A_ACTIVE_ACTIVE_Val    _UINT32_(0x1)                   /* (STATUS) Voltage phase A is active */
#define STATUS_STATE_FLAG_PH_B_ACTIVE_Pos           _UINT32_(1)                       /* (STATUS) Phase A active Position */
#define STATUS_STATE_FLAG_PH_B_ACTIVE_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_PH_B_ACTIVE_Pos)      /* (STATUS) Phase B active Mask */
#define STATUS_STATE_FLAG_PH_B_ACTIVE(value)        (STATUS_STATE_FLAG_PH_B_ACTIVE_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_PH_B_ACTIVE_Pos))
#define   STATUS_STATE_FLAG_PH_B_ACTIVE_INACTIVE_Val  _UINT32_(0x0)                   /* (STATUS) Voltage phase B is inactive  */
#define   STATUS_STATE_FLAG_PH_B_ACTIVE_ACTIVE_Val    _UINT32_(0x1)                   /* (STATUS) Voltage phase B is active */
#define STATUS_STATE_FLAG_PH_C_ACTIVE_Pos           _UINT32_(2)                       /* (STATUS) Phase A active Position */
#define STATUS_STATE_FLAG_PH_C_ACTIVE_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_PH_C_ACTIVE_Pos)      /* (STATUS) Phase C active Mask */
#define STATUS_STATE_FLAG_PH_C_ACTIVE(value)        (STATUS_STATE_FLAG_PH_C_ACTIVE_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_PH_C_ACTIVE_Pos))
#define   STATUS_STATE_FLAG_PH_C_ACTIVE_INACTIVE_Val  _UINT32_(0x0)                   /* (STATUS) Voltage phase C is inactive  */
#define   STATUS_STATE_FLAG_PH_C_ACTIVE_ACTIVE_Val    _UINT32_(0x1)                   /* (STATUS) Voltage phase C is active */
#define STATUS_STATE_FLAG_TIMING_Vx_Pos             _UINT32_(3)                       /* (STATUS) Active Voltage Channel Position */
#define STATUS_STATE_FLAG_TIMING_Vx_Msk             (_UINT32_(0x03) << STATUS_STATE_FLAG_TIMING_Vx_Pos)      /* (STATUS) Active Voltage Channel Mask */
#define STATUS_STATE_FLAG_TIMING_Vx(value)          (STATUS_STATE_FLAG_TIMING_Vx_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_TIMING_Vx_Pos))
#define   STATUS_STATE_FLAG_TIMING_Vx_A_Val           _UINT32_(0x0)                   /* (STATUS) Voltage phase VA is used for timing extraction purposes  */
#define   STATUS_STATE_FLAG_TIMING_Vx_B_Val           _UINT32_(0x1)                   /* (STATUS) Voltage phase VB is used for timing extraction purposes */
#define   STATUS_STATE_FLAG_TIMING_Vx_C_Val           _UINT32_(0x2)                   /* (STATUS) Voltage phase VC is used for timing extraction purposes */
#define STATUS_STATE_FLAG_FREQ_LOCKED_Pos           _UINT32_(5)                       /* (STATUS) Frequency Locked Flag Position */
#define STATUS_STATE_FLAG_FREQ_LOCKED_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_FREQ_LOCKED_Pos)      /* (STATUS) Frequency Locked Flag Mask */
#define STATUS_STATE_FLAG_FREQ_LOCKED(value)        (STATUS_STATE_FLAG_FREQ_LOCKED_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_FREQ_LOCKED_Pos))
#define   STATUS_STATE_FLAG_FREQ_LOCKED_DISABLED_Val   _UINT32_(0x0)                   /* (STATUS) Line frequency is not determined  */
#define   STATUS_STATE_FLAG_FREQ_LOCKED_ENABLED_Val    _UINT32_(0x1)                   /* (STATUS) Line frequency has been determined */
#define STATUS_STATE_FLAG_AFE_FAIL_Pos               _UINT32_(7)                       /* (STATUS) AFE state Position */
#define STATUS_STATE_FLAG_AFE_FAIL_Msk               (_UINT32_(0x01) << STATUS_STATE_FLAG_AFE_FAIL_Pos)      /* (STATUS) AFE state Mask */
#define STATUS_STATE_FLAG_AFE_FAIL(value)            (STATUS_STATE_FLAG_AFE_FAIL_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_AFE_FAIL_Pos))
#define   STATUS_STATE_FLAG_AFE_FAIL_DISABLED_Val      _UINT32_(0x0)                   /* (STATUS) AFE initialization is successful  */
#define   STATUS_STATE_FLAG_AFE_FAIL_ENABLED_Val       _UINT32_(0x1)                   /* (STATUS) AFE initialization is failed */
#define STATUS_STATE_FLAG_CREEP_DET_QA_Pos           _UINT32_(8)                       /* (STATUS) Reactive power creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_QA_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_QA_Pos)      /* (STATUS) Reactive power creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_QA(value)        (STATUS_STATE_FLAG_CREEP_DET_QA_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_QA_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_QA_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Reactive phase-A power creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_QA_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Reactive phase-A power creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_CREEP_DET_QB_Pos           _UINT32_(9)                       /* (STATUS) Reactive power creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_QB_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_QB_Pos)      /* (STATUS) Reactive power creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_QB(value)        (STATUS_STATE_FLAG_CREEP_DET_QB_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_QB_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_QB_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Reactive phase-B power creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_QB_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Reactive phase-B power creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_CREEP_DET_QC_Pos           _UINT32_(10)                       /* (STATUS) Reactive power creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_QC_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_QC_Pos)      /* (STATUS) Reactive power creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_QC(value)        (STATUS_STATE_FLAG_CREEP_DET_QC_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_QC_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_QC_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Reactive phase-C power creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_QC_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Reactive phase-C power creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_CREEP_DET_PA_Pos           _UINT32_(11)                       /* (STATUS) Active power creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_PA_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_PA_Pos)      /* (STATUS) Active power creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_PA(value)        (STATUS_STATE_FLAG_CREEP_DET_PA_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_PA_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_PA_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Active phase-A power creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_PA_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Active phase-A power creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_CREEP_DET_PB_Pos           _UINT32_(12)                       /* (STATUS) Active power creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_PB_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_PB_Pos)      /* (STATUS) Active power creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_PB(value)        (STATUS_STATE_FLAG_CREEP_DET_PB_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_PB_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_PB_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Active phase-B power creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_PB_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Active phase-B power creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_CREEP_DET_PC_Pos           _UINT32_(13)                       /* (STATUS) Active power creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_PC_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_PC_Pos)      /* (STATUS) Active power creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_PC(value)        (STATUS_STATE_FLAG_CREEP_DET_PC_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_PC_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_PC_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Active phase-C power creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_PC_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Active phase-C power creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_HOST_ID_FAIL_Pos           _UINT32_(15)                       /* (STATUS) Host Identification Failure Indication Position */
#define STATUS_STATE_FLAG_HOST_ID_FAIL_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_HOST_ID_FAIL_Pos)      /* (STATUS) Host Identification Failure Indication Mask */
#define STATUS_STATE_FLAG_HOST_ID_FAIL(value)        (STATUS_STATE_FLAG_HOST_ID_FAIL_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_HOST_ID_FAIL_Pos))
#define   STATUS_STATE_FLAG_HOST_ID_FAIL_SUCCESS_Val   _UINT32_(0x0)                   /* (STATUS) Proper PIC32CXMTx part successfully identified  */
#define   STATUS_STATE_FLAG_HOST_ID_FAIL_FAIL_Val      _UINT32_(0x1)                   /* (STATUS) Failed to identify proper PIC32CXMTx part */
#define STATUS_STATE_FLAG_CREEP_DET_IA_Pos           _UINT32_(16)                       /* (STATUS) Phase A Current Creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_IA_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_IA_Pos)      /* (STATUS) Phase A Current Creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_IA(value)        (STATUS_STATE_FLAG_CREEP_DET_IA_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_IA_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_IA_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Channel A current creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_IA_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Channel A current creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_CREEP_DET_IB_Pos           _UINT32_(17)                       /* (STATUS) Phase B Current Creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_IB_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_IB_Pos)      /* (STATUS) Phase B Current Creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_IB(value)        (STATUS_STATE_FLAG_CREEP_DET_IB_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_IB_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_IB_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Channel B current creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_IB_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Channel B current creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_CREEP_DET_IC_Pos           _UINT32_(18)                       /* (STATUS) Phase C Current Creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_IC_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_IC_Pos)      /* (STATUS) Phase C Current Creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_IC(value)        (STATUS_STATE_FLAG_CREEP_DET_IC_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_IC_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_IC_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Channel C current creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_IC_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Channel C current creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_CREEP_DET_Q_Pos            _UINT32_(19)                       /* (STATUS) Total Reactive Power Creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_Q_Msk            (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_Q_Pos)      /* (STATUS) Total Reactive Power Creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_Q(value)         (STATUS_STATE_FLAG_CREEP_DET_Q_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_Q_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_Q_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Reactive power creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_Q_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Reactive power creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_CREEP_DET_P_Pos            _UINT32_(20)                       /* (STATUS) Total Active Power Creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_P_Msk            (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_P_Pos)      /* (STATUS) Total Active Power Creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_P(value)         (STATUS_STATE_FLAG_CREEP_DET_P_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_P_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_P_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Active power creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_P_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Active power creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_ARCH_DETECT_FAIL_Pos            _UINT32_(21)                       /* (STATUS) Architecture Detect Failure Position */
#define STATUS_STATE_FLAG_ARCH_DETECT_FAIL_Msk            (_UINT32_(0x01) << STATUS_STATE_FLAG_ARCH_DETECT_FAIL_Pos)      /* (STATUS) Architecture Detect Failure Mask */
#define STATUS_STATE_FLAG_ARCH_DETECT_FAIL(value)         (STATUS_STATE_FLAG_ARCH_DETECT_FAIL_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_ARCH_DETECT_FAIL_Pos))
#define   STATUS_STATE_FLAG_ARCH_DETECT_FAIL_NO_FAIL_Val     _UINT32_(0x0)                   /* (STATUS) A proper device (?SH? or ?C?) was detected  */
#define   STATUS_STATE_FLAG_ARCH_DETECT_FAIL_FAIL_Val        _UINT32_(0x1)                   /* (STATUS) An improper device (not ?SH? nor ?C?) was detected */
#define STATUS_STATE_FLAG_PC_OUT_OF_RANGE_Pos            _UINT32_(22)                       /* (STATUS) Phase Corrector Out of Range Position */
#define STATUS_STATE_FLAG_PC_OUT_OF_RANGE_Msk            (_UINT32_(0x01) << STATUS_STATE_FLAG_PC_OUT_OF_RANGE_Pos)      /* (STATUS) Phase Corrector Out of Range Mask */
#define STATUS_STATE_FLAG_PC_OUT_OF_RANGE(value)         (STATUS_STATE_FLAG_PC_OUT_OF_RANGE_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_PC_OUT_OF_RANGE_Pos))
#define   STATUS_STATE_FLAG_PC_OUT_OF_RANGE_IN_Val         _UINT32_(0x0)                   /* (STATUS) Requested phase correction values in range  */
#define   STATUS_STATE_FLAG_PC_OUT_OF_RANGE_OUT_Val        _UINT32_(0x1)                   /* (STATUS) Requested phase correction values out of range */
#define STATUS_STATE_FLAG_CREEP_DET_S_Pos            _UINT32_(23)                       /* (STATUS) Total Apparent Power Creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_S_Msk            (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_S_Pos)      /* (STATUS) Total Apparent Power Creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_S(value)         (STATUS_STATE_FLAG_CREEP_DET_S_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_S_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_S_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Apparent power creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_S_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Apparent power creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_SAG_DET_VA_Pos                 _UINT32_(24)                       /* (STATUS) Voltage Sag Detected Flag for Channel A Position */
#define STATUS_STATE_FLAG_SAG_DET_VA_Msk                 (_UINT32_(0x01) << STATUS_STATE_FLAG_SAG_DET_VA_Pos)      /* (STATUS) Voltage Sag Detected Flag for Channel A Mask */
#define STATUS_STATE_FLAG_SAG_DET_VA(value)              (STATUS_STATE_FLAG_SAG_DET_VA_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_SAG_DET_VA_Pos))
#define   STATUS_STATE_FLAG_SAG_DET_VA_NO_DETECTED_Val     _UINT32_(0x0)                   /* (STATUS) Voltage sag isn?t detected in the current half line cycle  */
#define   STATUS_STATE_FLAG_SAG_DET_VA_DETECTED_Val        _UINT32_(0x1)                   /* (STATUS) Voltage sag is detected in the current half line cycle */
#define STATUS_STATE_FLAG_SAG_DET_VB_Pos                 _UINT32_(25)                       /* (STATUS) Voltage Sag Detected Flag for Channel B Position */
#define STATUS_STATE_FLAG_SAG_DET_VB_Msk                 (_UINT32_(0x01) << STATUS_STATE_FLAG_SAG_DET_VB_Pos)      /* (STATUS) Voltage Sag Detected Flag for Channel B Mask */
#define STATUS_STATE_FLAG_SAG_DET_VB(value)              (STATUS_STATE_FLAG_SAG_DET_VB_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_SAG_DET_VB_Pos))
#define   STATUS_STATE_FLAG_SAG_DET_VB_NO_DETECTED_Val     _UINT32_(0x0)                   /* (STATUS) Voltage sag isn?t detected in the current half line cycle  */
#define   STATUS_STATE_FLAG_SAG_DET_VB_DETECTED_Val        _UINT32_(0x1)                   /* (STATUS) Voltage sag is detected in the current half line cycle */
#define STATUS_STATE_FLAG_SAG_DET_VC_Pos                 _UINT32_(26)                       /* (STATUS) Voltage Sag Detected Flag for Channel C Position */
#define STATUS_STATE_FLAG_SAG_DET_VC_Msk                 (_UINT32_(0x01) << STATUS_STATE_FLAG_SAG_DET_VC_Pos)      /* (STATUS) Voltage Sag Detected Flag for Channel C Mask */
#define STATUS_STATE_FLAG_SAG_DET_VC(value)              (STATUS_STATE_FLAG_SAG_DET_VC_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_SAG_DET_VC_Pos))
#define   STATUS_STATE_FLAG_SAG_DET_VC_NO_DETECTED_Val     _UINT32_(0x0)                   /* (STATUS) Voltage sag isn?t detected in the current half line cycle  */
