Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_apps/prime_service_dual_metering_demo/src/config/pic32cx_mtsh_db_pl460_rf215/driver/metrology/drv_metrology_regs.h
#define   STATUS_STATE_FLAG_SAG_DET_VC_DETECTED_Val        _UINT32_(0x1)                   /* (STATUS) Voltage sag is detected in the current half line cycle */
#define STATUS_STATE_FLAG_SWELL_DET_VA_Pos                 _UINT32_(28)                       /* (STATUS) Voltage Swell Detected Flag for Channel A Position */
#define STATUS_STATE_FLAG_SWELL_DET_VA_Msk                 (_UINT32_(0x01) << STATUS_STATE_FLAG_SWELL_DET_VA_Pos)      /* (STATUS) Voltage Swell Detected Flag for Channel A Mask */
#define STATUS_STATE_FLAG_SWELL_DET_VA(value)              (STATUS_STATE_FLAG_SWELL_DET_VA_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_SWELL_DET_VA_Pos))
#define   STATUS_STATE_FLAG_SWELL_DET_VA_NO_DETECTED_Val     _UINT32_(0x0)                   /* (STATUS) Voltage swell isn?t detected in the current half line cycle  */
#define   STATUS_STATE_FLAG_SWELL_DET_VA_DETECTED_Val        _UINT32_(0x1)                   /* (STATUS) Voltage swell is detected in the current half line cycle */
#define STATUS_STATE_FLAG_SWELL_DET_VB_Pos                 _UINT32_(29)                       /* (STATUS) Voltage Swell Detected Flag for Channel B Position */
#define STATUS_STATE_FLAG_SWELL_DET_VB_Msk                 (_UINT32_(0x01) << STATUS_STATE_FLAG_SWELL_DET_VB_Pos)      /* (STATUS) Voltage Swell Detected Flag for Channel B Mask */
#define STATUS_STATE_FLAG_SWELL_DET_VB(value)              (STATUS_STATE_FLAG_SWELL_DET_VB_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_SWELL_DET_VB_Pos))
#define   STATUS_STATE_FLAG_SWELL_DET_VB_NO_DETECTED_Val     _UINT32_(0x0)                   /* (STATUS) Voltage swell isn?t detected in the current half line cycle  */
#define   STATUS_STATE_FLAG_SWELL_DET_VB_DETECTED_Val        _UINT32_(0x1)                   /* (STATUS) Voltage swell is detected in the current half line cycle */
#define STATUS_STATE_FLAG_SWELL_DET_VC_Pos                 _UINT32_(30)                       /* (STATUS) Voltage Swell Detected Flag for Channel C Position */
#define STATUS_STATE_FLAG_SWELL_DET_VC_Msk                 (_UINT32_(0x01) << STATUS_STATE_FLAG_SWELL_DET_VC_Pos)      /* (STATUS) Voltage Swell Detected Flag for Channel C Mask */
#define STATUS_STATE_FLAG_SWELL_DET_VC(value)              (STATUS_STATE_FLAG_SWELL_DET_VC_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_SWELL_DET_VC_Pos))
#define   STATUS_STATE_FLAG_SWELL_DET_VC_NO_DETECTED_Val     _UINT32_(0x0)                   /* (STATUS) Voltage swell isn?t detected in the current half line cycle  */
#define   STATUS_STATE_FLAG_SWELL_DET_VC_DETECTED_Val        _UINT32_(0x1)                   /* (STATUS) Voltage swell is detected in the current half line cycle */

/* -------- CAPTURE_STATUS :  (R/W  32) Waveform Capture Function Status -------- */
#define CAPTURE_STATUS_CAPTURE_OFFSET_Pos                  _UINT32_(0)                       /* (CAPTURE_STATUS) Offset within the buffer Position */
#define CAPTURE_STATUS_CAPTURE_OFFSET_Msk                  (_UINT32_(0xFFFFFF) << CAPTURE_STATUS_CAPTURE_OFFSET_Pos)      /* (CAPTURE_STATUS) Offset within the buffer Mask */
#define CAPTURE_STATUS_CAPTURE_OFFSET(value)               (CAPTURE_STATUS_CAPTURE_OFFSET_Msk & (_UINT32_(value) << CAPTURE_STATUS_CAPTURE_OFFSET_Pos))
#define CAPTURE_STATUS_CAPTURE_STATE_Pos                   _UINT32_(24)                       /* (CAPTURE_STATUS) Waveform Capture Status Position */
#define CAPTURE_STATUS_CAPTURE_STATE_Msk                   (_UINT32_(0xF) << CAPTURE_STATUS_CAPTURE_STATE_Pos)      /* (CAPTURE_STATUS) Waveform Capture Status Mask */
#define CAPTURE_STATUS_CAPTURE_STATE(value)                (CAPTURE_STATUS_CAPTURE_STATE_Msk & (_UINT32_(value) << CAPTURE_STATUS_CAPTURE_STATE_Pos))
#define   CAPTURE_STATUS_CAPTURE_STATE_DISABLED_Val          _UINT32_(0x0)                   /* (CAPTURE_STATUS) Disabled  */
#define   CAPTURE_STATUS_CAPTURE_STATE_ACTIVE_Val            _UINT32_(0x1)                   /* (CAPTURE_STATUS) Capture in progress  */
#define   CAPTURE_STATUS_CAPTURE_STATE_COMPLETE_Val          _UINT32_(0x2)                   /* (CAPTURE_STATUS) Capture completed  */
#define CAPTURE_STATUS_INVALID_ADDR_Pos                    _UINT32_(28)                       /* (CAPTURE_STATUS) Invalid Capture Address Position */
#define CAPTURE_STATUS_INVALID_ADDR_Msk                    (_UINT32_(0x1) << CAPTURE_STATUS_INVALID_ADDR_Pos)      /* (CAPTURE_STATUS) Invalid Capture Address Mask */
#define CAPTURE_STATUS_INVALID_ADDR(value)                 (CAPTURE_STATUS_INVALID_ADDR_Msk & (_UINT32_(value) << CAPTURE_STATUS_INVALID_ADDR_Pos))
#define   CAPTURE_STATUS_INVALID_ADDR_WITHIN_Val             _UINT32_(0x0)                   /* (CAPTURE_STATUS) Capture address within valid range   */
#define   CAPTURE_STATUS_INVALID_ADDR_OUTSIDE_Val            _UINT32_(0x1)                   /* (CAPTURE_STATUS) Capture address outside valid range  */
#define CAPTURE_STATUS_CAPTURE_WRAP_Pos                    _UINT32_(31)                       /* (CAPTURE_STATUS) Capture Buffer Wrapped Position */
#define CAPTURE_STATUS_CAPTURE_WRAP_Msk                    (_UINT32_(0x1) << CAPTURE_STATUS_CAPTURE_WRAP_Pos)      /* (STATUS) Capture Buffer Wrapped Mask */
#define CAPTURE_STATUS_CAPTURE_WRAP(value)                 (CAPTURE_STATUS_CAPTURE_WRAP_Msk & (_UINT32_(value) << CAPTURE_STATUS_CAPTURE_WRAP_Pos))
#define   CAPTURE_STATUS_CAPTURE_WRAP_NOT_WRAPPED_Val        _UINT32_(0x0)                   /* (CAPTURE_STATUS) Buffer has not wrapped  */
#define   CAPTURE_STATUS_CAPTURE_WRAP_WRAPPED_Val            _UINT32_(0x1)                   /* (CAPTURE_STATUS) Buffer has wrapped at least once */

/* -------- INTERVAL_NUM :  (R/W  32) Measurement Interval Number -------- */
#define INTERVAL_NUM_HALFCYCLE_COUNT_Pos                   _UINT32_(0)                       /* (INTERVAL_NUM) Subinterval number Position */
#define INTERVAL_NUM_HALFCYCLE_COUNT_Msk                   (_UINT32_(0xFFFF) << INTERVAL_NUM_HALFCYCLE_COUNT_Pos)      /* (INTERVAL_NUM) Subinterval number Mask */
#define INTERVAL_NUM_HALFCYCLE_COUNT(value)                (INTERVAL_NUM_HALFCYCLE_COUNT_Msk & (_UINT32_(value) << INTERVAL_NUM_HALFCYCLE_COUNT_Pos))
#define INTERVAL_NUM_INTERVAL_NUM_Pos                      _UINT32_(16)                       /* (INTERVAL_NUM) Interval number Position */
#define INTERVAL_NUM_INTERVAL_NUM_Msk                      (_UINT32_(0xFFFF) << INTERVAL_NUM_INTERVAL_NUM_Pos)      /* (INTERVAL_NUM) Interval number Mask */
#define INTERVAL_NUM_INTERVAL_NUM(value)                   (INTERVAL_NUM_INTERVAL_NUM_Msk & (_UINT32_(value) << INTERVAL_NUM_INTERVAL_NUM_Pos))

/* -------- N :  (R/W  32) Number of Samples in the Last Measurement Interval (uQ16.0) -------- */
#define N_Pos                            _UINT32_(0)                       /* (N) Number of Samples in the Last Measurement Interval Position */
#define N_Msk                            (_UINT32_(0xFFFF) << N_Pos)      /* (N) Number of Samples in the Last Measurement Interval Mask */
#define N_Val(value)                     (N_Msk & (_UINT32_(value) << N_Pos))

/* -------- PH_OFFSET :  (R/W  32) Phase Correction Filter Offset (sQ0.31) -------- */
#define PH_OFFSET_Pos                    _UINT32_(0)                       /* (PH_OFFSET) Phase Correction Filter Offset Position */
#define PH_OFFSET_Msk                    (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (PH_OFFSET) Phase Correction Filter Offset Mask */
#define PH_OFFSET_Val(value)             (PH_OFFSET_Msk & (_UINT32_(value) << PH_OFFSET_Pos))

/* -------- FREQ :  (R/W  32) Active Line Voltage Fundamental Harmonic Frequency (uQ20.12) -------- */
#define FREQ_Pos                         _UINT32_(0)                       /* (FREQ) Active Line Voltage Fundamental Harmonic Frequency Position */
#define FREQ_Msk                         (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (FREQ) Active Line Voltage Fundamental Harmonic Frequency Mask */
#define FREQ_Val(value)                  (FREQ_Msk & (_UINT32_(value) << FREQ_Pos))

/* -------- FREQ_VA :  (R/W  32) Frequency of fundamental harmonic, VA (uQ20.12) -------- */
#define FREQ_VA_Pos                      _UINT32_(0)                       /* (FREQ_VA) Frequency of fundamental harmonic, VA Position */
#define FREQ_VA_Msk                      (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (FREQ_VA) Frequency of fundamental harmonic, VA Mask */
#define FREQ_VA_Val(value)               (FREQ_VA_Msk & (_UINT32_(value) << FREQ_VA_Pos))

/* -------- FREQ_VB :  (R/W  32) Frequency of fundamental harmonic, VB (uQ20.12) -------- */
#define FREQ_VB_Pos                      _UINT32_(0)                       /* (FREQ_VB) Frequency of fundamental harmonic, VB Position */
#define FREQ_VB_Msk                      (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (FREQ_VB) Frequency of fundamental harmonic, VB Mask */
#define FREQ_VB_Val(value)               (FREQ_VB_Msk & (_UINT32_(value) << FREQ_VB_Pos))

/* -------- FREQ_VC :  (R/W  32) Frequency of fundamental harmonic, VC (uQ20.12) -------- */
#define FREQ_VC_Pos                      _UINT32_(0)                       /* (FREQ_VC) Frequency of fundamental harmonic, VC Position */
#define FREQ_VC_Msk                      (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (FREQ_VC) Frequency of fundamental harmonic, VC Mask */
#define FREQ_VC_Val(value)               (FREQ_VC_Msk & (_UINT32_(value) << FREQ_VC_Pos))

/* -------- TEMPERATURE :  (R/W  32) Sensor Temperature (sQ23.8) -------- */
#define TEMPERATURE_Pos                  _UINT32_(0)                       /* (TEMPERATURE) Sensor Temperature Position */
#define TEMPERATURE_Msk                  (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (TEMPERATURE) Sensor Temperature Mask */
#define TEMPERATURE_Val(value)           (TEMPERATURE_Msk & (_UINT32_(value) << TEMPERATURE_Pos))

/* -------- I_A_MAX :  (R/W  32) Phase A Current Peak (sQ2.29) -------- */
#define I_A_MAX_Pos                      _UINT32_(0)                       /* (I_A_MAX) Phase A Current Peak Position */
#define I_A_MAX_Msk                      (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (I_A_MAX) Phase A Current Peak Mask */
#define I_A_MAX_Val(value)               (I_A_MAX_Msk & (_UINT32_(value) << I_A_MAX_Pos))

/* -------- I_B_MAX :  (R/W  32) Phase B Current Peak (sQ2.29) -------- */
#define I_B_MAX_Pos                      _UINT32_(0)                       /* (I_B_MAX) Phase B Current Peak Position */
#define I_B_MAX_Msk                      (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (I_B_MAX) Phase B Current Peak Mask */
#define I_B_MAX_Val(value)               (I_B_MAX_Msk & (_UINT32_(value) << I_B_MAX_Pos))

/* -------- I_C_MAX :  (R/W  32) Phase C Current Peak (sQ2.29) -------- */
#define I_C_MAX_Pos                      _UINT32_(0)                       /* (I_C_MAX) Phase C Current Peak Position */
#define I_C_MAX_Msk                      (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (I_C_MAX) Phase C Current Peak Mask */
#define I_C_MAX_Val(value)               (I_C_MAX_Msk & (_UINT32_(value) << I_C_MAX_Pos))

/* -------- I_Ni_MAX :  (R/W  32) Neutral Current Peak (sQ16.15) -------- */
#define I_Ni_MAX_Pos                     _UINT32_(0)                       /* (I_Ni_MAX) Neutral Current Peak Position */
#define I_Ni_MAX_Msk                     (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (I_Ni_MAX) Neutral Current Peak Mask */
#define I_Ni_MAX_Val(value)              (I_Ni_MAX_Msk & (_UINT32_(value) << I_Ni_MAX_Pos))

/* -------- I_Nm_MAX :  (R/W  32) Neutral Current Peak (sQ16.15) -------- */
#define I_Nm_MAX_Pos                     _UINT32_(0)                       /* (I_Nm_MAX) Neutral Current Peak Position */
#define I_Nm_MAX_Msk                     (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (I_Nm_MAX) Neutral Current Peak Mask */
#define I_Nm_MAX_Val(value)              (I_Nm_MAX_Msk & (_UINT32_(value) << I_Nm_MAX_Pos))

/* -------- V_A_MAX :  (R/W  32) Voltage A Peak (sQ2.29) -------- */
#define V_A_MAX_Pos                      _UINT32_(0)                       /* V_A_MAX) Voltage A Peak Position */
#define V_A_MAX_Msk                      (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (V_A_MAX) Voltage A Peak Mask */
#define V_A_MAX_Val(value)               (V_A_MAX_Msk & (_UINT32_(value) << V_A_MAX_Pos))

