Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_apps/prime_service_dual_metering_demo/src/config/pic32cx_mtsh_db_pl460_rf215/driver/metrology/drv_metrology_regs.h
/* -------- V_B_MAX :  (R/W  32) Voltage B Peak (sQ2.29) -------- */
#define V_B_MAX_Pos                      _UINT32_(0)                       /* (V_B_MAX) Voltage B Peak Position */
#define V_B_MAX_Msk                      (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (V_B_MAX) Voltage B Peak Mask */
#define V_B_MAX_Val(value)               (V_B_MAX_Msk & (_UINT32_(value) << V_B_MAX_Pos))

/* -------- V_C_MAX :  (R/W  32) Voltage C Peak (sQ2.29) -------- */
#define V_C_MAX_Pos                      _UINT32_(0)                       /* (V_C_MAX) Voltage C Peak Position */
#define V_C_MAX_Msk                      (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (V_C_MAX) Voltage C Peak Mask */
#define V_C_MAX_Val(value)               (V_C_MAX_Msk & (_UINT32_(value) << V_C_MAX_Pos))

/* -------- FEATURES :  (R/W  32) Compiled feature indicator -------- */
#define FEATURES_DEBUG_MODES_Pos                    _UINT32_(0)
#define FEATURES_DEBUG_MODES_Msk                    (_UINT32_(0x1) << FEATURES_DEBUG_MODES_Pos)
#define FEATURES_DEBUG_MODES(value)                 (FEATURES_DEBUG_MODES_Msk & (_UINT32_(value) << FEATURES_DEBUG_MODES_Pos))
#define FEATURES_ATSENSE_HALF_CLK_Pos               _UINT32_(1)
#define FEATURES_ATSENSE_HALF_CLK_Msk               (_UINT32_(0x1) << FEATURES_ATSENSE_HALF_CLK_Pos)
#define FEATURES_ATSENSE_HALF_CLK(value)            (FEATURES_ATSENSE_HALF_CLK_Msk & (_UINT32_(value) << FEATURES_ATSENSE_HALF_CLK_Pos))
#define FEATURES_ATSENSE_SYNTHESIZE_Pos             _UINT32_(2)
#define FEATURES_ATSENSE_SYNTHESIZE_Msk             (_UINT32_(0x1) << FEATURES_ATSENSE_SYNTHESIZE_Pos)
#define FEATURES_ATSENSE_SYNTHESIZE(value)          (FEATURES_ATSENSE_SYNTHESIZE_Msk & (_UINT32_(value) << FEATURES_ATSENSE_SYNTHESIZE_Pos))
#define FEATURES_DUPLICATE_V1_Pos                   _UINT32_(3)
#define FEATURES_DUPLICATE_V1_Msk                   (_UINT32_(0x1) << FEATURES_DUPLICATE_V1_Pos)
#define FEATURES_DUPLICATE_V1(value)                (FEATURES_DUPLICATE_V1_Msk & (_UINT32_(value) << FEATURES_DUPLICATE_V1_Pos))
#define FEATURES_FIXED_VREF_Pos                     _UINT32_(4)
#define FEATURES_FIXED_VREF_Msk                     (_UINT32_(0x1) << FEATURES_FIXED_VREF_Pos)
#define FEATURES_FIXED_VREF(value)                  (FEATURES_FIXED_VREF_Msk & (_UINT32_(value) << FEATURES_FIXED_VREF_Pos))
#define FEATURES_DEBUG_CONST_PWM_PD18_Pos           _UINT32_(5)
#define FEATURES_DEBUG_CONST_PWM_PD18_Msk           (_UINT32_(0x1) << FEATURES_DEBUG_CONST_PWM_PD18_Pos)
#define FEATURES_DEBUG_CONST_PWM_PD18(value)        (FEATURES_DEBUG_CONST_PWM_PD18_Msk & (_UINT32_(value) << FEATURES_DEBUG_CONST_PWM_PD18_Pos))
#define FEATURES_DEBUG_DAC_PD19_Pos                 _UINT32_(6)
#define FEATURES_DEBUG_DAC_PD19_Msk                 (_UINT32_(0x1) << FEATURES_DEBUG_DAC_PD19_Pos)
#define FEATURES_DEBUG_DAC_PD19(value)              (FEATURES_DEBUG_DAC_PD19_Msk & (_UINT32_(value) << FEATURES_DEBUG_DAC_PD19_Pos))
#define FEATURES_DEBUG_FLEX_PC0_PC22_Pos            _UINT32_(7)
#define FEATURES_DEBUG_FLEX_PC0_PC22_Msk            (_UINT32_(0x1) << FEATURES_DEBUG_FLEX_PC0_PC22_Pos)
#define FEATURES_DEBUG_FLEX_PC0_PC22(value)         (FEATURES_DEBUG_FLEX_PC0_PC22_Msk & (_UINT32_(value) << FEATURES_DEBUG_FLEX_PC0_PC22_Pos))
#define FEATURES_HALF_COPROC_CLK_Pos                _UINT32_(8)
#define FEATURES_HALF_COPROC_CLK_Msk                (_UINT32_(0x1) << FEATURES_HALF_COPROC_CLK_Pos)
#define FEATURES_HALF_COPROC_CLK(value)             (FEATURES_HALF_COPROC_CLK_Msk & (_UINT32_(value) << FEATURES_HALF_COPROC_CLK_Pos))
#define FEATURES_I_N_MUXING_Pos                     _UINT32_(9)
#define FEATURES_I_N_MUXING_Msk                     (_UINT32_(0x1) << FEATURES_I_N_MUXING_Pos)
#define FEATURES_I_N_MUXING(value)                  (FEATURES_I_N_MUXING_Msk & (_UINT32_(value) << FEATURES_I_N_MUXING_Pos))
#define FEATURES_PQ_OFFSET_X_Pos                     _UINT32_(10)
#define FEATURES_PQ_OFFSET_X_Msk                    (_UINT32_(0x1) << FEATURES_PQ_OFFSET_X_Pos)
#define FEATURES_PQ_OFFSET_X(value)                 (FEATURES_PQ_OFFSET_X_Msk & (_UINT32_(value) << FEATURES_PQ_OFFSET_X_Pos))
#define FEATURES_RZC_DETECT_Pos                     _UINT32_(11)
#define FEATURES_RZC_DETECT_Msk                     (_UINT32_(0x1) << FEATURES_RZC_DETECT_Pos)
#define FEATURES_RZC_DETECT(value)                  (FEATURES_RZC_DETECT_Msk & (_UINT32_(value) << FEATURES_RZC_DETECT_Pos))
#define FEATURES_CORE_CLK_SPEED_Pos                 _UINT32_(12)
#define FEATURES_CORE_CLK_SPEED_Msk                 (_UINT32_(0xF) << FEATURES_CORE_CLK_SPEED_Pos)
#define FEATURES_CORE_CLK_SPEED(value)              (FEATURES_CORE_CLK_SPEED_Msk & (_UINT32_(value) << FEATURES_CORE_CLK_SPEED_Pos))
#define   FEATURES_CORE_CLK_SPEED_UNDEFINED_Val       _UINT32_(0x0)                   /* (FEATURES) Compiled to be used with Core-0 clock = undefined  */
#define   FEATURES_CORE_CLK_SPEED_102_Val             _UINT32_(0x1)                   /* (FEATURES) Compiled to be used with Core-0 clock = 102.400MHz */
#define   FEATURES_CORE_CLK_SPEED_106_Val             _UINT32_(0x2)                   /* (FEATURES) Compiled to be used with Core-0 clock = 106.496MHz */
#define   FEATURES_CORE_CLK_SPEED_110_Val             _UINT32_(0x3)                   /* (FEATURES) Compiled to be used with Core-0 clock = 110.592MHz */
#define   FEATURES_CORE_CLK_SPEED_114_Val             _UINT32_(0x4)                   /* (FEATURES) Compiled to be used with Core-0 clock = 114.688MHz */
#define   FEATURES_CORE_CLK_SPEED_118_Val             _UINT32_(0x5)                   /* (FEATURES) Compiled to be used with Core-0 clock = 118.784MHz */
#define   FEATURES_CORE_CLK_SPEED_240_Val             _UINT32_(0x6)                   /* (FEATURES) Compiled to be used with Core-0 clock = 240.000MHz */
#define   FEATURES_CORE_CLK_SPEED_237_Val             _UINT32_(0x7)                   /* (FEATURES) Compiled to be used with Core-0 clock = 237.568MHz */
#define FEATURES_DFT_ENABLED_Pos                    _UINT32_(16)
#define FEATURES_DFT_ENABLED_Msk                    (_UINT32_(0x1) << FEATURES_DFT_ENABLED_Pos)
#define FEATURES_DFT_ENABLED(value)                 (FEATURES_DFT_ENABLED_Msk & (_UINT32_(value) << FEATURES_DFT_ENABLED_Pos))
#define FEATURES_CREEP_Pos                          _UINT32_(17)
#define FEATURES_CREEP_Msk                          (_UINT32_(0x1) << FEATURES_CREEP_Pos)
#define FEATURES_CREEP(value)                       (FEATURES_CREEP_Msk & (_UINT32_(value) << FEATURES_CREEP_Pos))
#define FEATURES_CAPTURE_Pos                        _UINT32_(18)
#define FEATURES_CAPTURE_Msk                        (_UINT32_(0x1) << FEATURES_CAPTURE_Pos)
#define FEATURES_CAPTURE(value)                     (FEATURES_CAPTURE_Msk & (_UINT32_(value) << FEATURES_CAPTURE_Pos))
#define FEATURES_ROGOWSKI_DC_REMOVE_Pos             _UINT32_(19)
#define FEATURES_ROGOWSKI_DC_REMOVE_Msk             (_UINT32_(0x1) << FEATURES_ROGOWSKI_DC_REMOVE_Pos)
#define FEATURES_ROGOWSKI_DC_REMOVE(value)          (FEATURES_ROGOWSKI_DC_REMOVE_Msk & (_UINT32_(value) << FEATURES_ROGOWSKI_DC_REMOVE_Pos))
#define FEATURES_NUM_PULSES_Pos                     _UINT32_(20)
#define FEATURES_NUM_PULSES_Msk                     (_UINT32_(0x3) << FEATURES_NUM_PULSES_Pos)
#define FEATURES_NUM_PULSES(value)                  (FEATURES_NUM_PULSES_Msk & (_UINT32_(value) << FEATURES_NUM_PULSES_Pos))
#define FEATURES_ATSENSE_LOC_Pos                    _UINT32_(22)
#define FEATURES_ATSENSE_LOC_Msk                    (_UINT32_(0x1) << FEATURES_ATSENSE_LOC_Pos)
#define FEATURES_ATSensE_LOC(value)                 (FEATURES_ATSENSE_LOC_Msk & (_UINT32_(value) << FEATURES_ATSENSE_LOC_Pos))
#define FEATURES_MODIFY_CHIPID_Pos                  _UINT32_(23)
#define FEATURES_MODIFY_CHIPID_Msk                  (_UINT32_(0x1) << FEATURES_MODIFY_CHIPID_Pos)
#define FEATURES_MODIFY_CHIPID(value)               (FEATURES_MODIFY_CHIPID_Msk & (_UINT32_(value) << FEATURES_MODIFY_CHIPID_Pos))
#define FEATURES_Fs_SAMPLE_RATE_Pos                 _UINT32_(24)
#define FEATURES_Fs_SAMPLE_RATE_Msk                 (_UINT32_(0x1) << FEATURES_Fs_SAMPLE_RATE_Pos)
#define FEATURES_Fs_SAMPLE_RATE(value)              (FEATURES_Fs_SAMPLE_RATE_Msk & (_UINT32_(value) << FEATURES_Fs_SAMPLE_RATE_Pos))
#define   FEATURES_Fs_SAMPLE_RATE_4MHz_Val            _UINT32_(0x0)                   /* (FEATURES) Baseband sample rate FS = 4.000KHz  */
#define   FEATURES_Fs_SAMPLE_RATE_8MHz_Val            _UINT32_(0x1)                   /* (FEATURES) Baseband sample rate FS = 8.000KHz  */
#define FEATURES_I_Ni_SOURCE_Pos                    _UINT32_(25)
#define FEATURES_I_Ni_SOURCE_Msk                    (_UINT32_(0x1) << FEATURES_I_Ni_SOURCE_Pos)
#define FEATURES_I_Ni_SOURCE(value)                 (FEATURES_I_Ni_SOURCE_Msk & (_UINT32_(value) << FEATURES_I_Ni_SOURCE_Pos))
#define FEATURES_RCZ_OUT_Pos                        _UINT32_(26)
#define FEATURES_RCZ_OUT_Msk                        (_UINT32_(0x1) << FEATURES_RCZ_OUT_Pos)
#define FEATURES_RCZ_OUT(value)                     (FEATURES_RCZ_OUT_Msk & (_UINT32_(value) << FEATURES_RCZ_OUT_Pos))
#define FEATURES_DEBUG_ENABLE_VREF_TEST_DATA_Pos    _UINT32_(27)
#define FEATURES_DEBUG_ENABLE_VREF_TEST_DATA_Msk    (_UINT32_(0x1) << FEATURES_DEBUG_ENABLE_VREF_TEST_DATA_Pos)
#define FEATURES_DEBUG_ENABLE_VREF_TEST_DATA(value) (FEATURES_DEBUG_ENABLE_VREF_TEST_DATA_Msk & (_UINT32_(value) << FEATURES_DEBUG_ENABLE_VREF_TEST_DATA_Pos))
#define FEATURES_METER_TYPE_10_Pos                  _UINT32_(28)
#define FEATURES_METER_TYPE_10_Msk                  (_UINT32_(0x1) << FEATURES_METER_TYPE_10_Pos)
#define FEATURES_METER_TYPE_10(value)               (FEATURES_METER_TYPE_10_Msk & (_UINT32_(value) << FEATURES_METER_TYPE_10_Pos))
#define FEATURES_METER_TYPE_09_Pos                  _UINT32_(29)
#define FEATURES_METER_TYPE_09_Msk                  (_UINT32_(0x1) << FEATURES_METER_TYPE_09_Pos)
#define FEATURES_METER_TYPE_09(value)               (FEATURES_METER_TYPE_09_Msk & (_UINT32_(value) << FEATURES_METER_TYPE_09_Pos))
#define FEATURES_SINGLEPHASE_Pos                    _UINT32_(30)
#define FEATURES_SINGLEPHASE_Msk                    (_UINT32_(0x1) << FEATURES_SINGLEPHASE_Pos)
#define FEATURES_SINGLEPHASE(value)                 (FEATURES_SINGLEPHASE_Msk & (_UINT32_(value) << FEATURES_SINGLEPHASE_Pos))
#define FEATURES_POLYPHASE_Pos                      _UINT32_(31)
#define FEATURES_POLYPHASE_Msk                      (_UINT32_(0x1) << FEATURES_POLYPHASE_Pos)
#define FEATURES_POLYPHASE(value)                   (FEATURES_POLYPHASE_Msk & (_UINT32_(value) << FEATURES_POLYPHASE_Pos))

