Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_apps/prime_service_dual_metering_demo/src/config/pic32cx_mtsh_db_pl460_rf215/driver/metrology/drv_metrology_regs.h
/* -------- N_CYCLE :  (R/W  32) Number of Samples in the Last Measurement Interval (uQ32.0) -------- */
#define N_CYCLE_Pos                            _UINT32_(0)                       /* (N) Number samples in the last cycle Position */
#define N_CYCLE_Msk                            (_UINT32_(0xFFFF) << N_CYCLE_Pos)      /* (N) Number samples in the last cycle Mask */
#define N_CYCLE_Val(value)                     (N_CYCLE_Msk & (_UINT32_(value) << N_CYCLE_Pos))

/* -------- ZC_N_VA :  (R/W  32) Zero-crossing sample number of phase-A voltage (uQ20.12) -------- */
#define ZC_N_VA_Pos                    _UINT32_(0)
#define ZC_N_VA_Msk                    (_UINT32_(0xFFFFFF) << ZC_N_VA_Pos)
#define ZC_N_VA_Val(value)             (ZC_N_VA_Msk & (_UINT32_(value) << ZC_N_VA_Pos))

/* -------- ZC_N_VB :  (R/W  32) Zero-crossing sample number of phase-B voltage (uQ20.12) -------- */
#define ZC_N_VB_Pos                    _UINT32_(0)
#define ZC_N_VB_Msk                    (_UINT32_(0xFFFFFF) << ZC_N_VB_Pos)
#define ZC_N_VB_Val(value)             (ZC_N_VB_Msk & (_UINT32_(value) << ZC_N_VB_Pos))

/* -------- ZC_N_VC :  (R/W  32) Zero-crossing sample number of phase-C voltage (uQ20.12) -------- */
#define ZC_N_VC_Pos                    _UINT32_(0)
#define ZC_N_VC_Msk                    (_UINT32_(0xFFFFFF) << ZC_N_VC_Pos)
#define ZC_N_VC_Val(value)             (ZC_N_VC_Msk & (_UINT32_(value) << ZC_N_VC_Pos))

/* -------- ATSENSE_CAL_41_44 :  (R/W  32) ATSENSE Calibration Trim Data, Registers: 0x41 ? 0x44 -------- */
#define ATSENSE_CAL_41_44_REF_TL_11_8_Pos                   _UINT32_(0)
#define ATSENSE_CAL_41_44_REF_TL_11_8_Msk                   (_UINT32_(0xF) << ATSENSE_CAL_41_44_REF_TL_11_8_Pos)
#define ATSENSE_CAL_41_44_REF_TL_11_8(value)                (ATSENSE_CAL_41_44_REF_TL_11_8_Msk & (_UINT32_(value) << ATSENSE_CAL_41_44_REF_TL_11_8_Pos))
#define ATSENSE_CAL_41_44_REF_TL_0_7_Pos                    _UINT32_(8)
#define ATSENSE_CAL_41_44_REF_TL_0_7_Msk                    (_UINT32_(0xFF) << ATSENSE_CAL_41_44_REF_TL_0_7_Pos)
#define ATSENSE_CAL_41_44_REF_TL_0_7(value)                 (ATSENSE_CAL_41_44_REF_TL_0_7_Msk & (_UINT32_(value) << ATSENSE_CAL_41_44_REF_TL_0_7_Pos))
#define ATSENSE_CAL_41_44_TEMP_TL_11_8_Pos                  _UINT32_(16)
#define ATSENSE_CAL_41_44_TEMP_TL_11_8_Msk                  (_UINT32_(0xF) << ATSENSE_CAL_41_44_TEMP_TL_11_8_Pos)
#define ATSENSE_CAL_41_44_TEMP_TL_11_8(value)               (ATSENSE_CAL_41_44_TEMP_TL_11_8_Msk & (_UINT32_(value) << ATSENSE_CAL_41_44_TEMP_TL_11_8_Pos))
#define ATSENSE_CAL_41_44_TEMP_TL_0_7_Pos                   _UINT32_(24)
#define ATSENSE_CAL_41_44_TEMP_TL_0_7_Msk                   (_UINT32_(0xFF) << ATSENSE_CAL_41_44_TEMP_TL_0_7_Pos)
#define ATSENSE_CAL_41_44_TEMP_TL_0_7(value)                (ATSENSE_CAL_41_44_TEMP_TL_0_7_Msk & (_UINT32_(value) << ATSENSE_CAL_41_44_TEMP_TL_0_7_Pos))

/* -------- ATSENSE_CAL_45_48 :  (R/W  32) ATSENSE Calibration Trim Data, Registers: 0x45 ? 0x48 -------- */
#define ATSENSE_CAL_45_48_REF_TH_11_8_Pos                   _UINT32_(0)
#define ATSENSE_CAL_45_48_REF_TH_11_8_Msk                   (_UINT32_(0xF) << ATSENSE_CAL_45_48_REF_TH_11_8_Pos)
#define ATSENSE_CAL_45_48_REF_TH_11_8(value)                (ATSENSE_CAL_45_48_REF_TH_11_8_Msk & (_UINT32_(value) << ATSENSE_CAL_45_48_REF_TH_11_8_Pos))
#define ATSENSE_CAL_45_48_REF_TH_0_7_Pos                    _UINT32_(8)
#define ATSENSE_CAL_45_48_REF_TH_0_7_Msk                    (_UINT32_(0xFF) << ATSENSE_CAL_45_48_REF_TH_0_7_Pos)
#define ATSENSE_CAL_45_48_REF_TH_0_7(value)                 (ATSENSE_CAL_45_48_REF_TH_0_7_Msk & (_UINT32_(value) << ATSENSE_CAL_45_48_REF_TH_0_7_Pos))
#define ATSENSE_CAL_45_48_TEMP_TH_11_8_Pos                  _UINT32_(16)
#define ATSENSE_CAL_45_48_TEMP_TH_11_8_Msk                  (_UINT32_(0xF) << ATSENSE_CAL_45_48_TEMP_TH_11_8_Pos)
#define ATSENSE_CAL_45_48_TEMP_TH_11_8(value)               (ATSENSE_CAL_45_48_TEMP_TH_11_8_Msk & (_UINT32_(value) << ATSENSE_CAL_45_48_TEMP_TH_11_8_Pos))
#define ATSENSE_CAL_45_48_TEMP_TH_0_7_Pos                   _UINT32_(24)
#define ATSENSE_CAL_45_48_TEMP_TH_0_7_Msk                   (_UINT32_(0xFF) << ATSENSE_CAL_45_48_TEMP_TH_0_7_Pos)
#define ATSENSE_CAL_45_48_TEMP_TH_0_7(value)                (ATSENSE_CAL_45_48_TEMP_TH_0_7_Msk & (_UINT32_(value) << ATSENSE_CAL_45_48_TEMP_TH_0_7_Pos))

/* MISRA C-2023 deviation block end */

/** \brief Metrology Harmonic Analysis Output register API structure */
typedef struct
{
    __O  int32_t I_A_m_R[31];            /**< Offset: 0x00 (R/  32) The real part of DFT result for current, phase-A, m-th harmonics (sQ13.18) */
    __O  int32_t V_A_m_R[31];            /**< Offset: 0x7C (R/  32) The real part of DFT result for voltage, phase-A, m-th harmonics (sQ13.18) */
    __O  int32_t I_B_m_R[31];            /**< Offset: 0xF8 (R/  32) The real part of DFT result for current, phase-B, m-th harmonics (sQ13.18) */
    __O  int32_t V_B_m_R[31];            /**< Offset: 0x174 (R/  32) The real part of DFT result for voltage, phase-B, m-th harmonics (sQ13.18) */
    __O  int32_t I_C_m_R[31];            /**< Offset: 0x1F0 (R/  32) The real part of DFT result for current, phase-C, m-th harmonics (sQ13.18) */
    __O  int32_t V_C_m_R[31];            /**< Offset: 0x26C (R/  32) The real part of DFT result for voltage, phase-C, m-th harmonics (sQ13.18) */
    __O  int32_t I_N_m_R[31];            /**< Offset: 0x2E8 (R/  32) The real part of DFT result for voltage, phase-N, m-th harmonics (sQ13.18) */
    __O  int32_t I_A_m_I[31];            /**< Offset: 0x364 (R/  32) The imaginary part of DFT result for current, phase-A, m-th harmonics (sQ13.18) */
    __O  int32_t V_A_m_I[31];            /**< Offset: 0x3E0 (R/  32) The imaginary part of DFT result for voltage, phase-A, m-th harmonics (sQ13.18) */
    __O  int32_t I_B_m_I[31];            /**< Offset: 0x45C (R/  32) The imaginary part of DFT result for current, phase-B, m-th harmonics (sQ13.18) */
    __O  int32_t V_B_m_I[31];            /**< Offset: 0x4D8 (R/  32) The imaginary part of DFT result for voltage, phase-B, m-th harmonics (sQ13.18) */
    __O  int32_t I_C_m_I[31];            /**< Offset: 0x554 (R/  32) The imaginary part of DFT result for current, phase-C, m-th harmonics (sQ13.18) */
    __O  int32_t V_C_m_I[31];            /**< Offset: 0x5D0 (R/  32) The imaginary part of DFT result for voltage, phase-C, m-th harmonics (sQ13.18) */
    __O  int32_t I_N_m_I[31];            /**< Offset: 0x64C (R/  32) The imaginary part of DFT result for voltage, phase-N, m-th harmonics (sQ13.18) */
} DRV_METROLOGY_REGS_HARMONICS;

/** \brief Metrology Per-Cycle Accumulated Output register API structure */
typedef struct
{
    __O  uint64_t V_A;               /**< Offset: 0x000 (R/  64) Per-cycle Volt-(sQuared-samples, phase-A, fundamental + harmonics	(uQ24.40) */
    __O  uint64_t V_B;               /**< Offset: 0x008 (R/  64) Per-cycle Volt-(sQuared-samples, phase-B, fundamental + harmonics	(uQ24.40) */
    __O  uint64_t V_C;               /**< Offset: 0x010 (R/  64) Per-cycle Volt-(sQuared-samples, phase-C, fundamental + harmonics	(uQ24.40) */
    __O  uint64_t V_A_F;             /**< Offset: 0x018 (R/  64) Per-cycle Volt-(sQuared-samples, phase-A, fundamental only	(uQ24.40) */
    __O  uint64_t V_B_F;             /**< Offset: 0x020 (R/  64) Per-cycle Volt-(sQuared-samples, phase-B, fundamental only	(uQ24.40) */
    __O  uint64_t V_C_F;             /**< Offset: 0x028 (R/  64) Per-cycle Volt-(sQuared-samples, phase-C, fundamental only	(uQ24.40) */
    __O  uint64_t V_AB;              /**< Offset: 0x030 (R/  64) Per-cycle Volt-(sQuared-samples, VA â?? VB, fundamental + harmonics	(uQ24.40) */
    __O  uint64_t V_BC;              /**< Offset: 0x038 (R/  64) Per-cycle Volt-(sQuared-samples, VB â?? VC, fundamental + harmonics	(uQ24.40) */
    __O  uint64_t V_CA;              /**< Offset: 0x040 (R/  64) Per-cycle Volt-(sQuared-samples, VC â?? VA, fundamental + harmonics	(uQ24.40) */
    __O  uint64_t V_AB_F;            /**< Offset: 0x048 (R/  64) Per-cycle Volt-(sQuared-samples, VA â?? VB, fundamental only	(uQ24.40) */
    __O  uint64_t V_BC_F;            /**< Offset: 0x050 (R/  64) Per-cycle Volt-(sQuared-samples, VB â?? VC, fundamental only	(uQ24.40) */
    __O  uint64_t V_CA_F;            /**< Offset: 0x058 (R/  64) Per-cycle Volt-(sQuared-samples, VC â?? VA, fundamental only	(uQ24.40) */
    __O  uint64_t I_A;               /**< Offset: 0x060 (R/  64) Per-cycle Amp-(sQuared-samples, phase-A, fundamental + harmonics	(uQ24.40) */
    __O  uint64_t I_B;               /**< Offset: 0x068 (R/  64) Per-cycle Amp-(sQuared-samples, phase-B, fundamental + harmonics	(uQ24.40) */
    __O  uint64_t I_C;               /**< Offset: 0x070 (R/  64) Per-cycle Amp-(sQuared-samples, phase-C, fundamental + harmonics	(uQ24.40) */
    __O  uint64_t I_Nm;              /**< Offset: 0x078 (R/  64) Per-cycle Amp-(sQuared-samples, phase-N measured, fundamental + harmonics	(uQ24.40) */
    __O  uint64_t I_A_F;             /**< Offset: 0x080 (R/  64) Per-cycle Amp-(sQuared-samples, phase-A, fundamental only	(uQ24.40) */
    __O  uint64_t I_B_F;             /**< Offset: 0x088 (R/  64) Per-cycle Amp-(sQuared-samples, phase-B, fundamental only	(uQ24.40) */
    __O  uint64_t I_C_F;             /**< Offset: 0x090 (R/  64) Per-cycle Amp-(sQuared-samples, phase-C, fundamental only	(uQ24.40) */
    __O  uint64_t I_Nm_F;            /**< Offset: 0x098 (R/  64) Per-cycle Amp-(sQuared-samples, phase-N, fundamental only	(uQ24.40) */
    __O  int64_t P_A;                /**< Offset: 0x0A0 (R/  64) Per-cycle Watt-samples, phase-A, fundamental + harmonics	(sQ23.40) */
    __O  int64_t P_B;                /**< Offset: 0x0A8 (R/  64) Per-cycle Watt-samples, phase-B, fundamental + harmonics	(sQ23.40) */
    __O  int64_t P_C;                /**< Offset: 0x0B0 (R/  64) Per-cycle Watt-samples, phase-C, fundamental + harmonics	(sQ23.40) */
    __O  int64_t P_A_F;              /**< Offset: 0x0B8 (R/  64) Per-cycle Watt-samples, phase-A, fundamental only	(sQ23.40) */
    __O  int64_t P_B_F;              /**< Offset: 0x0C0 (R/  64) Per-cycle Watt-samples, phase-B, fundamental only	(sQ23.40) */
    __O  int64_t P_C_F;              /**< Offset: 0x0C8 (R/  64) Per-cycle Watt-samples, phase-C, fundamental only	(sQ23.40) */
    __O  int64_t P_N;                /**< Offset: 0x0D0 (R/  64) Per-cycle Watt-samples, phase-N, fundamental + harmonics	(sQ23.40) */
    __O  int64_t P_N_F;              /**< Offset: 0x0D8 (R/  64) Per-cycle Watt-samples, phase-N, fundamental only	(sQ23.40) */
    __O  int64_t Q_A;                /**< Offset: 0x0E0 (R/  64) Per-cycle VAR-samples, phase-A, fundamental + harmonics	(sQ23.40) */
    __O  int64_t Q_B;                /**< Offset: 0x0E8 (R/  64) Per-cycle VAR-samples, phase-B, fundamental + harmonics	(sQ23.40) */
    __O  int64_t Q_C;                /**< Offset: 0x0F0 (R/  64) Per-cycle VAR-samples, phase-C, fundamental + harmonics	(sQ23.40) */
    __O  int64_t Q_A_F;              /**< Offset: 0x0F8 (R/  64) Per-cycle VAR-samples, phase-A, fundamental only	(sQ23.40) */
    __O  int64_t Q_B_F;              /**< Offset: 0x100 (R/  64) Per-cycle VAR-samples, phase-B, fundamental only	(sQ23.40) */
    __O  int64_t Q_C_F;              /**< Offset: 0x108 (R/  64) Per-cycle VAR-samples, phase-C, fundamental only	(sQ23.40) */
    __O  int64_t Q_N;                /**< Offset: 0x110 (R/  64) Per-cycle VAR-samples, phase-N, fundamental + harmonics	(sQ23.40) */
    __O  int64_t Q_N_F;              /**< Offset: 0x118 (R/  64) Per-cycle VAR-samples, phase-N, fundamental only	(sQ23.40) */
} DRV_METROLOGY_REGS_PERCYCLE_ACC;

