Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_apps/prime_service_dual_metering_demo/src/config/pic32cx_mtsh_db_pl460_rf215/driver/metrology/drv_metrology_regs.h
/** \brief Metrology Accumulated Output register API structure */
typedef struct
{
    __O  uint64_t V_A;               /**< Offset: 0x000 (R/  64) Volt-square-samples, phase-A, fundamental + harmonics (uQ24.40) */
    __O  uint64_t V_B;               /**< Offset: 0x008 (R/  64) Volt-square-samples, phase-B, fundamental + harmonics (uQ24.40) */
    __O  uint64_t V_C;               /**< Offset: 0x010 (R/  64) Volt-square-samples, phase-C, fundamental + harmonics (uQ24.40) */
    __O  uint64_t V_D;               /**< Offset: 0x018 (R/  64) Volt-square-samples, phase-D, fundamental + harmonics (uQ24.40) */
    __O  uint64_t V_A_F;             /**< Offset: 0x020 (R/  64) Volt-square-samples, phase-A, fundamental only (uQ24.40) */
    __O  uint64_t V_B_F;             /**< Offset: 0x028 (R/  64) Volt-square-samples, phase-B, fundamental only (uQ24.40) */
    __O  uint64_t V_C_F;             /**< Offset: 0x030 (R/  64) Volt-square-samples, phase-C, fundamental only (uQ24.40) */
    __O  uint64_t V_D_F;             /**< Offset: 0x038 (R/  64) Volt-square-samples, phase-D, fundamental only (uQ24.40) */
    __O  uint64_t V_AB;              /**< Offset: 0x040 (R/  64) Volt-square-samples, VA - VB, fundamental + harmonics (uQ24.40) */
    __O  uint64_t V_BC;              /**< Offset: 0x048 (R/  64) Volt-square-samples, VB - VC, fundamental + harmonics (uQ24.40) */
    __O  uint64_t V_CA;              /**< Offset: 0x050 (R/  64) Volt-square-samples, VC - VA, fundamental + harmonics (uQ24.40) */
    __O  uint64_t V_AB_F;            /**< Offset: 0x058 (R/  64) Volt-square-samples, VA - VB, fundamental only (uQ24.40) */
    __O  uint64_t V_BC_F;            /**< Offset: 0x060 (R/  64) Volt-square-samples, VB - VC, fundamental only (uQ24.40) */
    __O  uint64_t V_CA_F;            /**< Offset: 0x068 (R/  64) Volt-square-samples, VC - VA, fundamental only (uQ24.40) */
    __O  uint64_t Reserved1;
    __O  uint64_t Reserved2;
    __O  uint64_t Reserved3;
    __O  uint64_t I_A;               /**< Offset: 0x088 (R/  64) Amp-squared-samples, phase-A, fundamental + harmonics (uQ24.40) */
    __O  uint64_t I_B;               /**< Offset: 0x090 (R/  64) Amp-squared-samples, phase-B, fundamental + harmonics (uQ24.40) */
    __O  uint64_t I_C;               /**< Offset: 0x098 (R/  64) Amp-squared-samples, phase-C, fundamental + harmonics (uQ24.40) */
    __O  uint64_t I_Ni;              /**< Offset: 0x0A0 (R/  64) Amp-squared-samples, phase-N inputed, fundamental + harmonics (uQ44.20) */
    __O  uint64_t I_Nm;              /**< Offset: 0x0A8 (R/  64) Amp-squared-samples, phase-N measured, fundamental + harmonics (uQ24.40) */
    __O  uint64_t I_A_F;             /**< Offset: 0x0B0 (R/  64) Amp-squared-samples, phase-A, fundamental only (uQ24.40) */
    __O  uint64_t I_B_F;             /**< Offset: 0x0B8 (R/  64) Amp-squared-samples, phase-B, fundamental only (uQ24.40) */
    __O  uint64_t I_C_F;             /**< Offset: 0x0C0 (R/  64) Amp-squared-samples, phase-C, fundamental only (uQ24.40) */
    __O  uint64_t I_Nmi;             /**< Offset: 0x0C8 (R/  64) Amp-squared-samples, raw phase-N measured minus imputed, fundamental + harmonics (uQ44.20) */
    __O  uint64_t I_Nm_F;            /**< Offset: 0x0D0 (R/  64) Amp-squared-samples, phase-N, fundamental only (uQ24.40) */
    __O  uint64_t Reserved4;
    __O  uint64_t Reserved5;
    __O  uint64_t Reserved6;
    __O  uint64_t Reserved7;
    __O  uint64_t Reserved8;
    __O  int64_t  P_A;               /**< Offset: 0x100 (R/  64) Watt-samples, phase-A, fundamental + harmonics (sQ23.40) */
    __O  int64_t  P_B;               /**< Offset: 0x108 (R/  64) Watt-samples, phase-B, fundamental + harmonics (sQ23.40) */
    __O  int64_t  P_C;               /**< Offset: 0x110 (R/  64) Watt-samples, phase-C, fundamental + harmonics (sQ23.40) */
    __O  int64_t  P_A_F;             /**< Offset: 0x118 (R/  64) Watt-samples, phase-A, fundamental only (sQ23.40) */
    __O  int64_t  P_B_F;             /**< Offset: 0x120 (R/  64) Watt-samples, phase-B, fundamental only (sQ23.40) */
    __O  int64_t  P_C_F;             /**< Offset: 0x128 (R/  64) Watt-samples, phase-C, fundamental only (sQ23.40) */
    __O  int64_t  P_N;               /**< Offset: 0x130 (R/  64) Watt-samples, phase-N, fundamental + harmonics (sQ23.40) */
    __O  int64_t  P_N_F;             /**< Offset: 0x138 (R/  64) Watt-samples, phase-N, fundamental only (sQ23.40) */
    __O  uint64_t Reserved9;
    __O  int64_t  Q_A;               /**< Offset: 0x148 (R/  64) VAR-samples, phase-A, fundamental + harmonics (sQ23.40) */
    __O  int64_t  Q_B;               /**< Offset: 0x150 (R/  64) VAR-samples, phase-B, fundamental + harmonics (sQ23.40) */
    __O  int64_t  Q_C;               /**< Offset: 0x158 (R/  64) VAR-samples, phase-C, fundamental + harmonics (sQ23.40) */
    __O  int64_t  Q_A_F;             /**< Offset: 0x160 (R/  64) VAR-samples, phase-A, fundamental only (sQ23.40) */
    __O  int64_t  Q_B_F;             /**< Offset: 0x168 (R/  64) VAR-samples, phase-B, fundamental only (sQ23.40) */
    __O  int64_t  Q_C_F;             /**< Offset: 0x170 (R/  64) VAR-samples, phase-C, fundamental only (sQ23.40) */
    __O  int64_t  Q_N;               /**< Offset: 0x178 (R/  64) VAR-samples, phase-N, fundamental + harmonics (sQ23.40) */
    __O  int64_t  Q_N_F;             /**< Offset: 0x180 (R/  64) VAR-samples, phase-N, fundamental only (sQ23.40) */
    __O  uint64_t Reserved10;
    __O  int64_t  ACC_T0;            /**< Offset: 0x190 (R/  64) Total accumulated quantities specified by PC0_TYPE (sQ33.30) */
    __O  int64_t  ACC_T1;            /**< Offset: 0x198 (R/  64) Total accumulated quantities specified by PC1_TYPE (sQ33.30) */
    __O  int64_t  ACC_T2;            /**< Offset: 0x1A0 (R/  64) Total accumulated quantities specified by PC2_TYPE (sQ33.30) */
    __O  uint64_t Reserved11;
    __O  uint64_t Reserved12;
} DRV_METROLOGY_REGS_ACCUMULATORS;

/** \brief Metrology Status register API structure */
typedef struct
{
    __O  uint32_t VERSION;                 /**< Offset: 0x00 (R/  32) Metrology firmware version */
    __O  uint32_t STATUS;                  /**< Offset: 0x04 (R/  32) Metrology status register */
    __O  uint32_t STATE_FLAG;              /**< Offset: 0x08 (R/  32) Metrology state flags register */
    __O  uint32_t CAPTURE_STATUS;          /**< Offset: 0x0C (R/  32) Waveform Capture Function Status */
    __O  uint32_t INTERVAL_NUM;            /**< Offset: 0x10 (R/  32) Interval number */
    __O  uint32_t N;                       /**< Offset: 0x14 (R/  32) Number of Samples in the Last Measurement Interval (uQ16.0) */
    __O  int32_t PH_OFFSET;                /**< Offset: 0x18 (R/  32) Phase Correction Filter Offset (sQ0.31) */
    __O  uint32_t FREQ;                    /**< Offset: 0x1C (R/  32) Active Line Voltage Fundamental Harmonic Frequency (uQ20.12) */
    __O  uint32_t FREQ_VA;                 /**< Offset: 0x20 (R/  32) Frequency of fundamental harmonic, VA (uQ20.12) */
    __O  uint32_t FREQ_VB;                 /**< Offset: 0x24 (R/  32) Frequency of fundamental harmonic, VB (uQ20.12) */
    __O  uint32_t FREQ_VC;                 /**< Offset: 0x28 (R/  32) Frequency of fundamental harmonic, VC (uQ20.12) */
    __O  uint32_t Reserved1;
    __O  int32_t TEMPERATURE;              /**< Offset: 0x30 (R/  32) Temperature, average (sQ23.8) */
    __O  int32_t V_A_MAX;                  /**< Offset: 0x34 (R/  32) Max phase-A voltage during measurement interval (sQ2.29)*/
    __O  int32_t V_B_MAX;                  /**< Offset: 0x38 (R/  32) Max phase-B voltage during measurement interval (sQ2.29)*/
    __O  int32_t V_C_MAX;                  /**< Offset: 0x3C (R/  32) Max phase-C voltage during measurement interval (sQ2.29)*/
    __O  uint32_t Reserved2;
    __O  int32_t I_A_MAX;                  /**< Offset: 0x44 (R/  32) Phase A Current Peak (sQ2.29) */
    __O  int32_t I_B_MAX;                  /**< Offset: 0x48 (R/  32) Phase B Current Peak (sQ2.29) */
    __O  int32_t I_C_MAX;                  /**< Offset: 0x4C (R/  32) Phase C Current Peak (sQ2.29) */
    __O  int32_t I_Nm_MAX;                 /**< Offset: 0x50 (R/  32) Max phase-N measured current during measurement interval (sQ2.29) */
    __O  int32_t I_Ni_MAX;                 /**< Offset: 0x54 (R/  32) Max phase-N imputed current during measurement interval (sQ16.15) */
    __O  uint32_t FEATURES;                /**< Offset: 0x58 (R/  32) Compiled feature indicator */
    __O  uint32_t N_CYCLE;                 /**< Offset: 0x5C (R/  32) Number samples in the last cycle (uQ32.0) */
    __O  uint32_t Reserved3;
    __O  uint32_t Reserved4;
    __O  uint32_t PULSE0_COUNTER;          /**< Offset: 0x68 (R/  32) Number of pulses issued (Pulse 0) */
    __O  uint32_t PULSE1_COUNTER;          /**< Offset: 0x6C (R/  32) Number of pulses issued (Pulse 1) */
    __O  uint32_t PULSE2_COUNTER;          /**< Offset: 0x70 (R/  32) Number of pulses issued (Pulse 2) */
    __O  uint32_t Reserved5;
    __O  uint32_t ZC_N_VA;                 /**< Offset: 0x78 (R/  32) Zero-crossing sample number of phase-A voltage (uQ20.12) */
    __O  uint32_t ZC_N_VB;                 /**< Offset: 0x7C (R/  32) Zero-crossing sample number of phase-B voltage (uQ20.12) */
    __O  uint32_t ZC_N_VC;                 /**< Offset: 0x80 (R/  32) Zero-crossing sample number of phase-C voltage (uQ20.12) */
    __O  uint32_t Reserved7;
    __O  uint32_t ATSENSE_CAL_41_44;       /**< Offset: 0x88 (R/  32) ATSense manufacturing calibration data, registers 41-44 */
    __O  uint32_t ATSENSE_CAL_45_48;       /**< Offset: 0x8C (R/  32) ATSense manufacturing calibration data, registers 45-48 */
} DRV_METROLOGY_REGS_STATUS;

/** \brief Metrology Control register API structure */
typedef struct
{
   __IO  uint32_t STATE_CTRL;              /**< Offset: 0x000 (R/W  32) Metrology state control register */
   __IO  uint32_t FEATURE_CTRL;            /**< Offset: 0x004 (R/W  32) Metrology feature setting register */
   __IO  uint32_t AFE_SELECTION;           /**< Offset: 0x008 (R/W  32) AFE selection register */
   __IO  uint32_t CHANNEL_MATRIX;          /**< Offset: 0x00C (R/W  32) Physical to logical channel assignment matrix */
   __IO  uint32_t HARMONIC_CTRL;           /**< Offset: 0x010 (R/W  32) Metrology feature setting register for Harmonics */
   __IO  uint32_t METER_TYPE;              /**< Offset: 0x014 (R/W  32) Sensor type and service type settings register */
   __IO  uint32_t M;                       /**< Offset: 0x018 (R/W  32) Number of line cycles for integration period (uQ12.0) */
   __IO  uint32_t N_MAX;                   /**< Offset: 0x01C (R/W  32) Maximum number of samples in an integration period (uQ24.0) */
   __IO  uint32_t PULSE0_CTRL;             /**< Offset: 0x020 (R/W  32) Pulse 0 control: enable/disable, polarity, quantity type selection */
   __IO  uint32_t PULSE0_K_t;              /**< Offset: 0x024 (R/W  32) Pulse 0 Meter constant register */
   __IO  uint32_t PULSE1_CTRL;             /**< Offset: 0x028 (R/W  32) Pulse 1 control: enable/disable, polarity, quantity type selection */
   __IO  uint32_t PULSE1_K_t;              /**< Offset: 0x02C (R/W  32) Pulse 1 Meter constant register */
   __IO  uint32_t PULSE2_CTRL;             /**< Offset: 0x030 (R/W  32) Pulse 2 control: enable/disable, polarity, quantity type selection */
   __IO  uint32_t PULSE2_K_t;              /**< Offset: 0x034 (R/W  32) Pulse 2 Meter constant register */
   __IO  uint32_t SYNTHESIZER_ADDR;        /**< Offset: 0x038 (R/W  32) Synthesizer address */
   __IO  uint32_t CREEP_THRESHOLD_P;       /**< Offset: 0x03C (R/W  32) Creep Threshold for Active Energy (uQ2.30) */
   __IO  uint32_t CREEP_THRESHOLD_P_A;     /**< Offset: 0x040 (R/W  32) Starting per-cycle phase-A Active Energy for pulse and pulse accumulation (uQ2.30) */
   __IO  uint32_t CREEP_THRESHOLD_P_B;     /**< Offset: 0x044 (R/W  32) Starting per-cycle phase-B Active Energy for pulse and pulse accumulation (uQ2.30) */
   __IO  uint32_t CREEP_THRESHOLD_P_C;     /**< Offset: 0x048 (R/W  32) Starting per-cycle phase-C Active Energy for pulse and pulse accumulation (uQ2.30) */
   __IO  uint32_t CREEP_THRESHOLD_Q;       /**< Offset: 0x04C (R/W  32) Creep Threshold for Quadergy (uQ2.30) */
   __IO  uint32_t CREEP_THRESHOLD_Q_A;     /**< Offset: 0x050 (R/W  32) Starting per-cycle phase-A Reactive Quadergy for pulse and pulse accumulation (uQ2.30) */
   __IO  uint32_t CREEP_THRESHOLD_Q_B;     /**< Offset: 0x054 (R/W  32) Starting per-cycle phase-B Reactive Quadergy for pulse and pulse accumulation (uQ2.30) */
   __IO  uint32_t CREEP_THRESHOLD_Q_C;     /**< Offset: 0x058 (R/W  32) Starting per-cycle phase-C Reactive Quadergy for pulse and pulse accumulation (uQ2.30) */
   __IO  uint32_t CREEP_THRESHOLD_I;       /**< Offset: 0x05C (R/W  32) Creep Threshold of Phase Current (uQ2.30) */
   __IO  uint32_t CREEP_THRESHOLD_I_A;     /**< Offset: 0x060 (R/W  32) Starting per-cycle phase-A current for both Energy and Quadergy pulse and pulse accumulation (uQ2.30) */
   __IO  uint32_t CREEP_THRESHOLD_I_B;     /**< Offset: 0x064 (R/W  32) Starting per-cycle phase-B current for both Energy and Quadergy pulse and pulse accumulation (uQ2.30) */
   __IO  uint32_t CREEP_THRESHOLD_I_C;     /**< Offset: 0x068 (R/W  32) Starting per-cycle phase-C current for both Energy and Quadergy pulse and pulse accumulation (uQ2.30) */
   __IO  uint32_t CREEP_THRESHOLD_S;       /**< Offset: 0x06C (R/W  32) Creep Threshold of Phase Apparent Power (uQ2.30) */
   __IO  uint32_t POWER_OFFSET_CTRL;       /**< Offset: 0x070 (R/W  32) Power offset control */
   __IO  int32_t POWER_OFFSET_P;           /**< Offset: 0x074 (R/W  32) Active Power Offset (sQ1.30) */
   __IO  int32_t POWER_OFFSET_Q;           /**< Offset: 0x078 (R/W  32) Reactive Power Offset (sQ1.30) */
   __IO  int32_t POWER_OFFSET_S;           /**< Offset: 0x07C (R/W  32) Apparent Power Offset (sQ1.30) */
   __IO  uint32_t SWELL_THRESHOLD_VA;      /**< Offset: 0x080 (R/W  32) Voltage swell threshold for each half cycle of phase-A voltage (uQ0.32) */
   __IO  uint32_t SWELL_THRESHOLD_VB;      /**< Offset: 0x084 (R/W  32) Voltage swell threshold for each half cycle of phase-B voltage (uQ0.32) */
   __IO  uint32_t SWELL_THRESHOLD_VC;      /**< Offset: 0x088 (R/W  32) Voltage swell threshold for each half cycle of phase-C voltage (uQ0.32) */
   __IO  uint32_t SAG_THRESHOLD_VA;        /**< Offset: 0x08C (R/W  32) Voltage sag threshold for each half cycle of phase-A voltage (uQ0.32) */
   __IO  uint32_t SAG_THRESHOLD_VB;        /**< Offset: 0x090 (R/W  32) Voltage sag threshold for each half cycle of phase-B voltage (uQ0.32) */
   __IO  uint32_t SAG_THRESHOLD_VC;        /**< Offset: 0x094 (R/W  32) Voltage sag threshold for each half cycle of phase-B voltage (uQ0.32) */
   __IO  uint32_t INTERRUPT_THRESHOLD_VA;  /**< Offset: 0x098 (R/W  32) Interrupt threshold for each half cycle of phase-A voltage (uQ0.32) */
   __IO  uint32_t INTERRUPT_THRESHOLD_VB;  /**< Offset: 0x09C (R/W  32) Interrupt threshold for each half cycle of phase-B voltage (uQ0.32) */
   __IO  uint32_t INTERRUPT_THRESHOLD_VC;  /**< Offset: 0x0A0 (R/W  32) Interrupt threshold for each half cycle of phase-C voltage (uQ0.32) */
   __IO  uint32_t Reserved1;
   __IO  uint32_t Reserved2;
   __IO  uint32_t Reserved3;
   __IO  uint32_t K_IA;                    /**< Offset: 0x0B0 (R/W  32) ADC input current conversion factor = I_A(rms)/Vadc(rms) (uQ22.10) */
   __IO  uint32_t K_VA;                    /**< Offset: 0x0B4 (R/W  32) ADC input voltage conversion factor = V_A(rms)/Vadc(rms) (uQ22.10) */
   __IO  uint32_t K_IB;                    /**< Offset: 0x0B8 (R/W  32) ADC input current conversion factor = I_B(rms)/Vadc(rms) (uQ22.10) */
   __IO  uint32_t K_VB;                    /**< Offset: 0x0BC (R/W  32) ADC input voltage conversion factor = V_B(rms)/Vadc(rms) (uQ22.10) */
   __IO  uint32_t K_IC;                    /**< Offset: 0x0C0 (R/W  32) ADC input current conversion factor = I_C(rms)/Vadc(rms) (uQ22.10) */
   __IO  uint32_t K_VC;                    /**< Offset: 0x0C4 (R/W  32) ADC input voltage conversion factor = V_C(rms)/Vadc(rms) (uQ22.10) */
   __IO  uint32_t K_IN;                    /**< Offset: 0x0C8 (R/W  32) ADC input current conversion factor = I_N(rms)/Vadc(rms) (uQ22.10) */
   __IO  uint32_t K_VD;                    /**< Offset: 0x0CC (R/W  32) ADC input voltage conversion factor = V_D(rms)/Vadc(rms) (uQ22.10) */
   __IO  int32_t CAL_M_IA;                 /**< Offset: 0x0D0 (R/W  32) Current magnitude calibration constant, I_A  (sQ2.29) */
   __IO  int32_t CAL_M_VA;                 /**< Offset: 0x0D4 (R/W  32) Voltage magnitude calibration constant, V_A  (sQ2.29) */
   __IO  int32_t CAL_M_IB;                 /**< Offset: 0x0D8 (R/W  32) Current magnitude calibration constant, I_B  (sQ2.29) */
   __IO  int32_t CAL_M_VB;                 /**< Offset: 0x0DC (R/W  32) Voltage magnitude calibration constant, V_B  (sQ2.29) */
   __IO  int32_t CAL_M_IC;                 /**< Offset: 0x0E0 (R/W  32) Current magnitude calibration constant, I_C  (sQ2.29) */
   __IO  int32_t CAL_M_VC;                 /**< Offset: 0x0E4 (R/W  32) Voltage magnitude calibration constant, V_C  (sQ2.29) */
   __IO  int32_t CAL_M_IN;                 /**< Offset: 0x0E8 (R/W  32) Current magnitude calibration constant, I_N  (sQ2.29) */
   __IO  int32_t CAL_M_VD;                 /**< Offset: 0x0EC (R/W  32) Current magnitude calibration constant, V_D  (sQ2.29) */
   __IO  int32_t CAL_PH_IA;                /**< Offset: 0x0F0 (R/W  32) Current phase calibration constant, I_A (sQ0.31) */
   __IO  int32_t CAL_PH_VA;                /**< Offset: 0x0F4 (R/W  32) Voltage phase calibration constant, V_A (sQ0.31) */
   __IO  int32_t CAL_PH_IB;                /**< Offset: 0x0F8 (R/W  32) Current phase calibration constant, I_B (sQ0.31) */
   __IO  int32_t CAL_PH_VB;                /**< Offset: 0x0FC (R/W  32) Voltage phase calibration constant, V_B (sQ0.31) */
   __IO  int32_t CAL_PH_IC;                /**< Offset: 0x100 (R/W  32) Current phase calibration constant, I_C (sQ0.31) */
   __IO  int32_t CAL_PH_VC;                /**< Offset: 0x104 (R/W  32) Voltage phase calibration constant, V_C (sQ0.31) */
   __IO  int32_t CAL_PH_IN;                /**< Offset: 0x108 (R/W  32) Current phase calibration constant, I_N (sQ0.31) */
   __IO  uint32_t Reserved4;
   __IO  uint32_t CAPTURE_CTRL;            /**< Offset: 0x110 (R/W  32) Waveform capture control register */
   __IO  uint32_t CAPTURE_BUFF_SIZE;       /**< Offset: 0x114 (R/W  32) Waveform capture buffer size in units of 32-bits */
   __IO  uint32_t CAPTURE_ADDR;            /**< Offset: 0x118 (R/W  32) Waveform capture buffer address pointer */
   __IO  uint32_t Reserved5;
   __IO  uint32_t Reserved6;
   __IO  uint32_t Reserved7;
   __IO  uint32_t AFE_CTRL;                /**< Offset: 0x128 (R/W  32) AFE control register */
   __IO  uint32_t Reserved8;
   __IO  uint32_t Reserved9;
   __IO  uint32_t Reserved10;
   __IO  int32_t POWER_OFFSET_P_A;         /**< Offset: 0x138 (R/W  32) Phase-A active power offset (sQ-9.40) */
   __IO  int32_t POWER_OFFSET_P_B;         /**< Offset: 0x13C (R/W  32) Phase-B active power offset (sQ-9.40) */
   __IO  int32_t POWER_OFFSET_P_C;         /**< Offset: 0x140 (R/W  32) Phase-C active power offset (sQ-9.40) */
   __IO  int32_t POWER_OFFSET_Q_A;         /**< Offset: 0x144 (R/W  32) Phase-A reactive power offset (sQ-9.40) */
   __IO  int32_t POWER_OFFSET_Q_B;         /**< Offset: 0x148 (R/W  32) Phase-B reactive power offset (sQ-9.40) */
   __IO  int32_t POWER_OFFSET_Q_C;         /**< Offset: 0x14C (R/W  32) Phase-C reactive power offset (sQ-9.40) */
} DRV_METROLOGY_REGS_CONTROL;

/** \brief METROLOGY register API structure */
typedef struct
{
    DRV_METROLOGY_REGS_CONTROL       MET_CONTROL;         /**< Offset: 0x0000 (R/W  32) Metrology Control Registers */
    DRV_METROLOGY_REGS_STATUS        MET_STATUS;          /**< Offset: 0x0150 (R/   32) Metrology Status Registers */
    DRV_METROLOGY_REGS_ACCUMULATORS  MET_ACCUMULATORS;    /**< Offset: 0x01E0 (R/   32) Metrology Accumulated Output Registers */
    DRV_METROLOGY_REGS_PERCYCLE_ACC  MET_PERCYCLE_ACC;    /**< Offset: 0x0398 (R/   32) Metrology Per-Cycle Accumulated Output Registers */
    DRV_METROLOGY_REGS_HARMONICS     MET_HARMONICS;       /**< Offset: 0x04B8 (R/   32) Metrology Harmonic Analysis Output Registers */
} MET_REGISTERS;

#endif /* METROLOGY_REGS_H */